[
  {
    "title": "Kicking off Monterey Car Week With a Motorlux Preview",
    "link": "https://www.autoblog.com/features/kicking-off-monterey-car-week-with-a-motorlux-preview",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3NDg1/motorlux-2024.jpg",
    "description": "It’s August, and that means one thing for car collectors and enthusiasts: Monterey Car Week! I’ve heard that around 100,000 people will descend upon the California beach town of Monterey and its surrounding areas to get their fill of cars and car culture. I’ll be one of them, thanks to my hosts at ...",
    "source": "Autoblog",
    "titleSummary": "\"Exclusive First Look at Monterey's Premier Automotive Extravaganza\"",
    "descriptionSummary": "Monterey Car Week is finally here, bringing with it a thrilling convergence of automotive enthusiasts in this picturesque coastal town on California's Central Coast. Over 100,000 people are expected to gather for a week-long celebration of all things cars."
  },
  {
    "title": "Zeekr 9X Packs 1,381 HP and the Largest Battery Ever in a PHEV",
    "link": "https://www.autoblog.com/news/new-chinese-suv-packs-1381-hp-and-the-largest-battery-ever-in-a-phev",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MjY1/zeekr-9x-0005.jpg",
    "description": "Zeekr, the premium electric vehicle brand under Geely, has officially unveiled its first plug-in hybrid — and it’s making a statement in both numbers and ambition. The Zeekr 9X is a full-size flagship SUV with the largest battery ever fitted to a PHEV, at 70 kWh, paired to a hybrid system producing ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Supercar Smashes Records with Jaw-Dropping Power and Unprecedented Range Capability\"",
    "descriptionSummary": "Zeekr, Geely's premium electric vehicle brand, has launched its first plug-in hybrid model, making a bold entrance with the Zeekr 9X. This full-size flagship SUV boasts an unprecedented 70-kilowatt-hour battery and a cutting-edge hybrid powertrain."
  },
  {
    "title": "Going Just 1 MPH Under Speed Limit Could Land You in Jail in Louisiana",
    "link": "https://www.autoblog.com/news/in-louisiana-going-1-mph-under-the-limit-in-the-left-lane-could-cost-you-fines-or-even-jail",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTE2OTY0/louisiana-state-police-car.jpg",
    "description": "Louisiana drivers lingering in the left lane now have even less margin for error. A new law that took effect August 1 allows police to ticket anyone driving just&nbsp;1 mph under the speed limit&nbsp;in the passing lane without a valid reason. First-time offenders face a $150 fine, a second offense ...",
    "source": "Autoblog",
    "titleSummary": "\"Louisiana's Strict Speed Laws: A Ticket Away from Jail Time\"",
    "descriptionSummary": "A stricter left-lane enforcement has kicked in for Louisiana drivers, with cops now empowered to cite vehicles cruising at 1mph below the speed limit in passing lanes unless there's a legitimate excuse. First-time offenders can expect a $150 fine."
  },
  {
    "title": "Here’s Why Cadillac Doesn’t Have A Blackwing-Badged EV",
    "link": "https://www.autoblog.com/news/why-cadillac-doesnt-have-a-blackwing-ev",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MzEy/blackwing.jpg",
    "description": "Cadillac’s Blackwing sedans need no introduction. Both the CT4-V Blackwing and CT5-V Blackwing are wildly entertaining sports sedans that are old-school in the best possible way, as they each offer rear-wheel drive and manual gearboxes. In a completely different segment, Cadillac is dominating in ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Silence: The Reason Behind Cadillac's Absence from the Blackwing Lineup\"",
    "descriptionSummary": "Cadillac's high-performance Blackwing models - CT4-V and CT5-V - deliver unbridled driving excitement with their manual transmissions and rear-wheel drive configurations, harkening back to a bygone era of pure, uncomplicated sports car thrills."
  },
  {
    "title": "Two Corvette ZR1s Stolen from GM’s Bowling Green Plant, Both Recovered",
    "link": "https://www.autoblog.com/news/two-corvette-zr1s-stolen-from-gms-bowling-green-plant-and-recovered-after-high-speed-chase",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTEzODUw/2025-chevrolet-corvette-zr1.avif",
    "description": "The Corvette world was shaken over the weekend when two brand-new C8 ZR1s were stolen directly from GM’s Bowling Green Assembly Plant in Kentucky — only for both to be recovered in dramatic fashion. The incident adds to a growing list of high-profile performance car thefts, raising questions about ...",
    "source": "Autoblog",
    "titleSummary": "\"High-Performance Heist Foiled: Corvette ZR1s Snatched from Factory Floor, Swiftly Returned\"",
    "descriptionSummary": "A daring heist shook the Corvette community when two brand-new C8 ZR1s vanished from General Motors' Kentucky plant, but were later recovered in a thrilling turn of events, leaving authorities scrambling for answers."
  },
  {
    "title": "Toyota Will Hate Hyundai’s Tucson N Hybrid Plans",
    "link": "https://www.autoblog.com/news/hyundai-tucson-n-hybrid-vs-toyota-rav4-gr-sport",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MTkw/photo-937190.jpg",
    "description": "Hyundai’s high-performance N division has established quite a reputation for itself, especially when you consider that its first product in North America—the Veloster N—only arrived here in 2019. Since then, the division has shown that whether it’s a small crossover like the Kona N or an electric ...",
    "source": "Autoblog",
    "titleSummary": "Hyundai's Tucson Hybrid Steals Thunder with Performance Boost",
    "descriptionSummary": "Hyundai's high-performance N division has made a swift impression since its North American debut with the Veloster N in 2019. Its subsequent releases have consistently showcased innovative designs and capabilities across various models, including crossovers and electrics."
  },
  {
    "title": "Now's Your Chance to Buy a 1996 Dodge Viper GTS with Delivery Mileage",
    "link": "https://www.autoblog.com/news/30-year-old-dodge-viper-gts-for-sale-with-just-45-miles",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MTAy/1996-dodge-viper-gts-04-copy.jpg",
    "description": "The Dodge Viper GTS has long been a paradox among sports cars. It is at once a straightforward machine – brutal power from an 8.0-liter V10, a six-speed manual, and none of the electronic safety nets that have since become standard – and an object of poster-worthy desire.&nbsp; The first-year 1996 ...",
    "source": "Autoblog",
    "titleSummary": "Low-Mile '96 Dodge Viper GTS Hits the Market, Still in Factory Fresh Condition",
    "descriptionSummary": "The Dodge Viper GTS is a sports car of stark contrasts: a raw, unapologetic beast powered by a massive V10 engine, yet a coveted status symbol for its sleek design. Its untamed essence debuted in the 1996 model year."
  },
  {
    "title": "Toyota Drops Turbocharged 2025 GR Supra Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-toyota-gr-supra-lease-deal-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTMxMDAzMTEzMDU2MTAw/2020-toyota-supra.jpg",
    "description": "While the end of the current Toyota Supra generation is nearing rapidly, it isn’t too late to lease one. In August, Toyota is offering the 2026 Toyota Supra at $904 per month for 36 months with $3,554 due at signing. Included are 12,000 miles per year and ToyotaCare, the latter of which covers ...",
    "source": "Autoblog",
    "titleSummary": "\"Turbocharged Supra Leasing Spins Out for August, But At What Cost?\"",
    "descriptionSummary": "Don't count out a new Toyota Supra just yet – there's still time to lease one before its current generation disappears from showrooms. A limited-time deal is available in August for $904/month over 36 months with a down payment of $3,554, along with annual mileage and maintenance coverage."
  },
  {
    "title": "This Looks Like A Rare Mercedes W120 Pickup, But It's Actually An AMG A45 Truck",
    "link": "https://www.autoblog.com/news/mercedes-benz-w120-ponton-a45-amg-restomod",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MzM2/mercedes-w120-a45-based-180d.jpg",
    "description": "You've almost certainly never seen anything like this before. Even if you know what a W120 180D 'Ponton' sedan is, you probably haven't seen the pickup made for South Africa (even though this version sold in higher numbers there). And a restomod (or something to that approximation) based on one is ...",
    "source": "Autoblog",
    "titleSummary": "\"Meet the Slick Deceiver: A Humble Ute Hides an AMG Powerhouse Within\"",
    "descriptionSummary": "This unusual creation is likely to leave even enthusiasts of the W120 180D 'Ponton' sedan bewildered. Its South African pickup variant, once popular locally, now emerges in a unique, high-performance iteration."
  },
  {
    "title": "Ford Offers Rugged 2025 Bronco Raptor Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-ford-bronco-lease-deal-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5NDAyNTk3NTQ5Njgw/2024-ford-bronco-raptor-black-appearance-package.jpg",
    "description": "The Ford Bronco Raptor is not your average SUV. Developed by Ford Performance, it’s the most extreme version of the revived Bronco, blending Baja-ready suspension hardware with the street manners needed for daily driving. Since debuting in 2022, it has built a loyal following among off-roaders who ...",
    "source": "Autoblog",
    "titleSummary": "Ford Unveils Limited-Time Lease Promotion for 2025 Bronco Raptor in August",
    "descriptionSummary": "The Ford Bronco Raptor is an uncompromising SUV that combines unapologetic off-road capability with refined on-road performance, thanks to its potent suspension setup and daily-driving civility. This rugged performer has won over enthusiasts since its 2022 introduction."
  },
  {
    "title": "Rolls-Royce customers now spend an average of $500K per car",
    "link": "https://www.autoblog.com/news/rolls-royce-buyers-now-spend-over-500k-thanks-to-bespoke-builds-some-cost-millions",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMjM4MTg4MjM1ODU5NTM0/rolls-royce-phantom-goldfinger-soe.jpg",
    "description": "As one of the most storied names in automotive lore, Rolls-Royce exists firmly in the \"if you have to ask, you probably can't afford it\" category of car brands. But that high-dollar transaction price has also proved to be a moving target since BMW began exerting its influence in 2003. That's ...",
    "source": "Autoblog",
    "titleSummary": "Luxury Motors Take Hefty Price Hikes to New Heights",
    "descriptionSummary": "Rolls-Royce is a byword for luxury and exclusivity, with a rich history that commands respect. However, the brand's premium pricing has shown remarkable elasticity since BMW took the reins in 2003, shifting the financial landscape of ultra-high-end vehicles."
  },
  {
    "title": "2024 Corvette E-Ray Drops $30K in Value After Just 1,600 Miles",
    "link": "https://www.autoblog.com/news/2024-corvette-e-ray-drops-30k-in-value-after-just-1600-miles",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2OTg0/ai3a2799-low-res-04122-fe4nem-scaled.jpg",
    "description": "With the number of listings for brand-new sports cars and other enthusiast-focused fare on websites like Bring a Trailer, it's tempting to think that holding onto a car rather than driving it is always the smart move. But the owner of a 2024 Chevrolet Corvette E-Ray recently found out that ...",
    "source": "Autoblog",
    "titleSummary": "\"Corvette E-Ray's Price Plunge Raises Questions About Performance's Cost\"",
    "descriptionSummary": "The allure of rare sports cars listed online can make holding onto a prized vehicle seem wise, but one enthusiast learned firsthand that sometimes letting go can be the best decision, especially when storage costs add up."
  },
  {
    "title": "Ford Offers Killer 2025 F-150 Raptor Lease Offer for August",
    "link": "https://www.autoblog.com/carbuying/2025-ford-f150-raptor-lease-offer-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTA1Njgz/2024-ford-f-150-raptor.jpg",
    "description": "The Ford F-150 Raptor isn’t just another pickup. Since its debut in 2010, it’s stood apart as a purpose-built high-performance off-roader—engineered for high-speed desert running, rugged trail work, and still capable of towing and hauling when the workday calls. With aggressive styling, long-travel ...",
    "source": "Autoblog",
    "titleSummary": "\"Blazing Deals Ahead: Ford's Steal of an Offer on the '25 F-150 Raptor\"",
    "descriptionSummary": "The Ford F-150 Raptor is a breed apart from other pickups. Engineered to conquer demanding terrain, it combines desert racing prowess with practical hauling capabilities, all wrapped in an aggressively styled package that's ready for whatever comes next."
  },
  {
    "title": "This Enthusiast-Pleasing Genesis Sedan Could Be Dead Soon",
    "link": "https://www.autoblog.com/news/enthusiast-pleasing-genesis-sedan-could-be-dead-soon",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM3MTU5/photo-937159.jpg",
    "description": "The Genesis G70 is one of the most enjoyable compact luxury sedans on the market, and it’s easier to think of reasons you should buy one than why you shouldn’t. Unfortunately, despite still being in its first generation, it looks like the G70 may not survive beyond that. This is the prediction made ...",
    "source": "Autoblog",
    "titleSummary": "\"Popular Genesis Model Faces Uncertain Future Amid Ongoing Rebranding Efforts\"",
    "descriptionSummary": "The Genesis G70 stands out as a compact luxury sedan par excellence, boasting an impressive array of qualities that make owning one a resounding good idea. However, reports suggest this first-generation model's lifespan might be limited to just that - its first generation."
  },
  {
    "title": "Chevrolet Camaro ZL1 Rumored To Return As 1,000-HP Electric Crossover",
    "link": "https://www.autoblog.com/news/rumor-chevrolet-camaro-zl1-returning-1000-hp-ev-crossover",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTc2NjYyNjQ0NjMxMzk2/2012-chevrolet-camaro-zl1.jpg",
    "description": "Even before the sixth and last generation of the Chevrolet Camaro had been discontinued, there were rumors that General Motors was considering applying the nameplate to vehicles with more than two doors. GM neither confirmed nor denied what plans it had for future products, but MotorTrend is now ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Muscle Revival: Chevy Teases a Torque-Filled Reboot of Iconic Camaro ZL1\"",
    "descriptionSummary": "Rumors have long swirled about a potential expansion of the Chevrolet Camaro brand beyond its traditional coupe and convertible forms. General Motors has remained tight-lipped on its future product plans, fueling speculation about the iconic nameplate's next chapter."
  },
  {
    "title": "BYD’s Next Electric Supercar Packs Nearly 3,000 Horsepower",
    "link": "https://www.autoblog.com/news/byds-next-electric-supercar-packs-nearly-3000-horsepower",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2ODc4/1200x0_1_autohomecar__chxpvwivwlyafya5aamx2tkugru675-picsart-aiimageenhancer-2048x1123.jpg",
    "description": "New details on the Yangwang U9 Track Edition, a new variant of the U9 electric supercar from BYD's Yangwang brand, have been revealed by China's Ministry of Industry and Information Technology (MIIT). And they point to one of the most powerful EVs to date. According to CarNewsChina, the filing ...",
    "source": "Autoblog",
    "titleSummary": "BYD Unveils Beastly New EV with Electrifying Performance to Match Its Ferocious Power",
    "descriptionSummary": "BYD's high-performance Yangwang U9 Track Edition has emerged with new features following a recent filing from China's Ministry of Industry and Information Technology. The updated specs hint at an exceptionally potent electric vehicle."
  },
  {
    "title": "Ford Recalls Another 103,000 F-150 Pickups That Could Roll Away",
    "link": "https://www.autoblog.com/news/ford-recalls-103000-f-150-pickups-rear-axle-bolt",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyODM1MTgyODkyNDI2NzYx/2025-ford-f-150-stx.jpg",
    "description": "Yesterday, Ford announced that it would be killing off the Escape next year to make way for a new mid-size electric pickup in the $30k range. But in the meantime, it has issues to address on its current truck, the F-150, after Reuters was first to report today that a new recall has been issued by ...",
    "source": "Autoblog",
    "titleSummary": "\"Ford Issues Urgent Recall of 103,000 F-150s Prone to Spontaneous Movement.\"",
    "descriptionSummary": "Ford is poised to debut a new mid-size electric pickup next year, priced around $30,000, but the automaker's immediate focus lies elsewhere - addressing pressing concerns on its current bestseller, the F-150. A new recall has just been announced."
  },
  {
    "title": "Roadtripping a Nissan Frontier: Here's My Honest Review From This Adventure",
    "link": "https://www.autoblog.com/reviews/roadtripping-a-nissan-frontier-heres-my-honest-review-from-this-adventure",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODgyNzAy/2025-nissan-frontier.png",
    "description": "I’ve driven the Nissan Frontier plenty of times off-road, in traffic, towing loads, but never on a real road trip. This time, that changed. Nissan invited me to Lake Arrowhead Resort for a drive that would take us from Southern California’s wide freeways to rural highways and winding mountain ...",
    "source": "Autoblog",
    "titleSummary": "\"Rugged Roads Tested: A Firsthand Account of Life in a Nissan Frontier\"",
    "descriptionSummary": "I recently had the chance to experience the Nissan Frontier's capabilities in a more nuanced way - trading in my usual off-road excursions and towing duties for a leisurely drive through the mountains, from busy freeways to scenic backroads."
  },
  {
    "title": "Ford Rolls Out Tempting 2025 Escape Lease Deals for August",
    "link": "https://www.autoblog.com/carbuying/2025-ford-escape-lease-deals-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODgzMTQw/2023-ford-escape-st-line-elite.jpg",
    "description": "The Ford Escape has been a fixture in the compact SUV market for more than two decades, blending practical size with a comfortable ride and useful tech. Over the years, it has evolved from a simple, boxy runabout into a sleeker, more refined vehicle that still nails the everyday utility shoppers ...",
    "source": "Autoblog",
    "titleSummary": "\"Ford Lures Buyers with Sweet 2025 Escape Leases in August\"",
    "descriptionSummary": "For over 20 years, the Ford Escape has remained a compact SUV powerhouse, seamlessly merging space-saving practicality with a smooth ride and cutting-edge technology to deliver reliable daily driving performance."
  },
  {
    "title": "I Road Tripped a 2025 Lexus TX 350 Luxury AWD and This is My Honest Take",
    "link": "https://www.autoblog.com/reviews/i-road-tripped-a-2025-lexus-tx-350-luxury-awd-and-this-is-my-honest-take",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MTQx/2025-lexus-tx-350-awd-luxury.jpg",
    "description": "As both an automotive journalist and a dad of three, I’m very interested in three-row SUVs. It’s not because I think they’re great to drive (they're not), but when an automaker builds a new one, I put it through the wringer with my family to see if it passes muster. Last year, the Toyota Grand ...",
    "source": "Autoblog",
    "titleSummary": "\"Lexus Takes the Long Haul in its Luxe 4x4 Flagship: A Hands-On Review\"",
    "descriptionSummary": "As both an automotive enthusiast and a father of three, I'm eager to test three-row SUVs - not for their driving dynamics, but to see if they can deliver on practicality and comfort for families like mine when they hit the market."
  },
  {
    "title": "Honda Drops Aggressive 2025 Prologue Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-honda-prologue-lease-deal-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5NTU2NDEwMjc5Nzgw/2024-honda-prologue.jpg",
    "description": "If the name “Prologue” sounds like Honda’s first EV, you’re not entirely wrong—but it’s not the first ever. That title technically goes to the short-lived Clarity and Fit EVs. This time around, the Prologue is stepping in as a placeholder until Honda rolls out its own fully in-house electric ...",
    "source": "Autoblog",
    "titleSummary": "\"Honda Lowers the Boom on 2025 Prologue Leases This August\"",
    "descriptionSummary": "Honda's latest all-electric offering, dubbed \"Prologue\", may seem like a debutante, but it's actually a transitional model preceding a lineup of full-fledged EVs from the manufacturer."
  },
  {
    "title": "IIHS Wants 3 Canadian Driving Laws to Increase U.S. Road Safety",
    "link": "https://www.autoblog.com/news/iihs-wants-3-canadian-driving-laws-to-increase-u-s-road-safety",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MTA5/testing-at-insurance-institute-for-highway-safety-iihs-headquarters-in-ruckersville-virginia.jpg",
    "description": "The Insurance Institute for Highway Safety (IIHS) has highlighted multiple Canadian driving laws that it believes would decrease U.S. traffic fatality rates. The IIHS is advocating that the U.S. mirror Canada by expanding its use of traffic enforcement cameras while increasing the stringency of ...",
    "source": "Autoblog",
    "titleSummary": "\"Canada's Safer Roads: IIHS Seeks U.S. Adoption of Key Traffic Reforms\"",
    "descriptionSummary": "The Insurance Institute for Highway Safety recommends adopting more stringent traffic enforcement measures in the US, citing Canada's success with cameras and strict regulations as a model to reduce road fatalities and improve safety."
  },
  {
    "title": "Ford Drops Affordable 2025 F-150 Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-ford-f150-lease-deal-august",
    "pubDate": "8/12/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyODM1MTgyODkyMjk1Njg5/2025-ford-f-150.jpg",
    "description": "The Ford F-150 has been America’s best-selling vehicle for over four decades, a streak built on capability, adaptability, and a constant willingness to evolve. Whether it’s hauling gear to a job site or towing a camper for a weekend getaway, the F-150 has been the go-to for drivers who need their ...",
    "source": "Autoblog",
    "titleSummary": "\"Ford Axed Popular 2025 F-150 Leasing Incentive for August Buyers\"",
    "descriptionSummary": "For over 40 years, the Ford F-150 has reigned as America's top-selling vehicle, its enduring popularity rooted in its impressive versatility and commitment to innovation. It's the trusted companion of outdoor enthusiasts and DIYers alike."
  },
  {
    "title": "Audi RS6 Avant is having its best sales year ever",
    "link": "https://www.autoblog.com/news/audi-rs6-avant-is-having-its-best-sales-year-ever",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2NzU0/original-13542-0k2a5246.jpg",
    "description": "They may set car enthusiasts' hearts aflutter, but performance cars are often niche models that struggle to justify their existence with sales. But the Audi RS6 Avant isn't one of those unfortunate cases. Audi says the high-performance wagon is having its best sales year ever. And that's despite ...",
    "source": "Autoblog",
    "titleSummary": "Audi's Performance Wagon Hits High Gear with Record-Breaking Sales Year",
    "descriptionSummary": "Audi's high-performance RS6 Avant has bucked the trend, defying expectations to post record-breaking sales. This impressive feat comes as a welcome surprise for enthusiasts and the brand alike, shining a light on the model's enduring appeal."
  },
  {
    "title": "1967 Jaguar XKE Series I 4.2 Roadster With Low Miles",
    "link": "https://www.autoblog.com/carbuying/1967-jaguar-xke-series-i-4-2-roadster-for-sale-with-low-miles",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2ODg0/screen-shot-2025-08-11-at-10851-pm.png",
    "description": "With its impossibly long bonnet, low stance, and perfect proportions, this 1967 Jaguar XKE Series I 4.2 Roadster is as much a work of art as it is a sports car. Finished in a rich Opalescent Maroon, it has been fully restored and is ready for the kind of top-down drives that stick in your memory. ...",
    "source": "Autoblog",
    "titleSummary": "Rare 1967 Jaguar Convertible Packs Impeccable Condition and a Low-Mileage Profile",
    "descriptionSummary": "This stunning 1967 Jaguar XKE Series I 4.2 Roadster exudes elegance with its sleek, low-slung design and beautifully proportioned lines, all perfectly complemented by a rich, jewel-toned finish in Opalescent Maroon."
  },
  {
    "title": "2 Reasons Why Hybrids Present More Complicated Fire Risks",
    "link": "https://www.autoblog.com/news/2-reasons-why-hybrids-present-more-complicated-fire-risks",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MTgw/2024-volvo-s90-recharge-plug-in-hybrid.jpg",
    "description": "A transportation risk mitigation expert has explained in an interview with Autoblog why hybrids can present more complicated fire risks that people haven’t thought about. William S. Lerner, a consultant for lithium-ion battery and hydrogen technology safety in transportation, conceded that since ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Fuel Mix Sparks New Concerns for Hybrid Vehicle Fires\"",
    "descriptionSummary": "A renowned transportation safety expert discusses the often-overlooked fire hazards associated with hybrid vehicles, citing unique challenges posed by their complex energy systems."
  },
  {
    "title": "Sony and Honda’s First EV Enters Pre-Production in Ohio",
    "link": "https://www.autoblog.com/news/sony-and-hondas-first-ev-enters-pre-production-in-ohio",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5MDU1NTExODgxMzI4/afeela-05.jpg",
    "description": "Sony Honda Mobility’s first electric vehicle, the Afeela 1, has entered pre-production at Honda’s East Liberty Auto Plant in Ohio. Engineers at the facility are using this stage to fine-tune part fit, paint finish, and assembly precision ahead of full production, scheduled to begin in 2026. The ...",
    "source": "Autoblog",
    "titleSummary": "Honda-Sony Electric Vehicle Takes Shape in Ohio Factory Ahead of Debut",
    "descriptionSummary": "Sony Honda Mobility's inaugural electric vehicle, Afeela 1, is now undergoing pre-production refinement at Honda's Ohio factory. Engineers will focus on perfecting details such as part alignment, paint quality, and assembly before mass production begins in 2026."
  },
  {
    "title": "GM Plans to Resurrect Self-Driving Car Project With a Twist",
    "link": "https://www.autoblog.com/news/gm-plans-to-resurrect-self-driving-car-project-with-a-twist",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2ODg1/a-chevrolet-bolt-cruise-robotaxi-operating-in-san-francisco-2019.jpg",
    "description": "General Motors (GM) has begun reigniting its defunct self-driving Cruise business by approaching some of the subsidiary’s former employees for recruitment. However, the automaker is said to be pivoting from Cruise’s original mission of creating a robotaxi into manufacturing autonomous cars for ...",
    "source": "Autoblog",
    "titleSummary": "GM Revives Autonomous Vehicle Initiative with Unconventional Approach",
    "descriptionSummary": "General Motors is reviving its dormant autonomous division, Cruise, by re-recruiting former employees and shifting focus from developing self-driving taxis to producing autonomous vehicles that can be integrated into existing fleets."
  },
  {
    "title": "Hyundai Announces Killer 2025 Elantra Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-hyundai-elantra-lease-deal-august",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTMzMDU2/large-66526-2026elantra.jpg",
    "description": "Who says sedans are dead? The mainstream compact sedan segment battle is still a ferocious one, with four proven models battling it out. The 2025 Hyundai Elantra is one of the main contenders against the likes of the Honda Civic, the Nissan Sentra, and the Toyota Corolla. The Elantra pushes the ...",
    "source": "Autoblog",
    "titleSummary": "\"Hyundai Unleashes Summer Steal on 2025 Elantra Leases in August\"",
    "descriptionSummary": "The compact sedan market remains fiercely competitive, with several top-notch models vying for dominance. Among them is the 2025 Hyundai Elantra, a formidable challenger to established favorites like the Honda Civic, Nissan Sentra, and Toyota Corolla."
  },
  {
    "title": "Enough Is Enough: San Diego Police Crush Street Takeover Cars in Crackdown",
    "link": "https://www.autoblog.com/news/san-diego-police-are-crushing-cars-to-stop-street-takeovers",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MzU1/638277040263570000.jpg",
    "description": "San Diego police are taking an unusually hard line against illegal street takeovers, reviving a tactic they haven’t used in nearly two decades: crushing seized vehicles. Acting under court orders, officers recently destroyed two machines linked to reckless stunt driving — a Toyota Chaser and a ...",
    "source": "Autoblog",
    "titleSummary": "\"City Takes Back Streets: Police Quash Reckless Driving Epidemic in Downtown San Diego\"",
    "descriptionSummary": "San Diego authorities have stepped up their crackdown on street takeovers, employing an aggressive new strategy that involves impounding and crushing vehicles involved in reckless stunt driving, following a nearly 20-year hiatus from this approach."
  },
  {
    "title": "2001 BMW M5 For Auction With 32,000 Miles and a Manual Transmission",
    "link": "https://www.autoblog.com/carbuying/2001-bmw-m5-for-auction-1",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM1MDI3/screenshot-2025-08-07-224027.png",
    "description": "It’s not every day that you come across such a glorious, low-mileage E39 BMW M5, but here we are. Widely considered the best M5 manual transmission model, the E39 M5 wasn’t the most powerful, but it was the most engaging. A naturally-aspirated V8 engine under the hood, sublime chassis balance, and ...",
    "source": "Autoblog",
    "titleSummary": "\"Rare Manual BMW Supercar Hits the Block with Just 32K on the Clock\"",
    "descriptionSummary": "Rarely does a remarkably well-preserved E39 BMW M5 with low mileage cross our path, boasting exceptional driving dynamics courtesy of its manual transmission and 5-liter V8 engine, renowned for delivering a thrilling and balanced driving experience."
  },
  {
    "title": "BMW Says Its Revival of Rolls-Royce Was a Secret Operation",
    "link": "https://www.autoblog.com/news/bmw-says-its-revival-of-rolls-royce-was-a-secret-operation",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2NjIy/phantom_in_new_york.jpg",
    "description": "To many people who are and aren’t car enthusiasts, the British ultra-luxury brand Rolls-Royce is recognized as one of the most well-known brands producing some of the most luxurious cars on the road.&nbsp;Today, they’re owned by another name known for uncharted luxury and refinement: BMW. The ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW's Stealth Takeover of Iconic Rolls-Royce Left Few in the Know\"",
    "descriptionSummary": "Rolls-Royce is synonymous with opulence, its reputation built over decades as a purveyor of the world's most sumptuous vehicles. Now part of the BMW group, this legendary brand continues to set the standard for luxury on wheels."
  },
  {
    "title": "New Dodge Charger Misses Out On Durango’s Coolest Option",
    "link": "https://www.autoblog.com/news/dodge-charger-misses-durangos-coolest-option",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MzMw/dg026_010du.jpg",
    "description": "Last week, Dodge announced the 2026 Durango with two changes that will please enthusiasts. One, the enduring SUV will still be available with the supercharged 6.2-liter V8 making 710 horsepower. The other relates to customization, as the Durango Hellcat will be available with the Jailbreak package, ...",
    "source": "Autoblog",
    "titleSummary": "\"Dodge Charger Left in the Dust by Durango's Performance Edge\"",
    "descriptionSummary": "Dodge has unveiled the 2026 Durango, boasting a thrilling upgrade for enthusiasts: the legendary SUV will now be paired with a supercharged V8 engine producing 710 horsepower, alongside an exciting new customization option."
  },
  {
    "title": "I Drove the 2025 Lexus NX 350 F Sport. Here’s My Brutally Honest Review",
    "link": "https://www.autoblog.com/reviews/i-drove-the-2025-lexus-nx-350-f-sport-heres-my-brutally-honest-review",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2Njg5/2025-lexus-nx.jpg",
    "description": "It was reliable, comfortable, and looked sharp enough, but it never really tugged at your heartstrings. This new-generation NX, however, is an entirely different animal. Lexus stepped up its game, and after a week behind the wheel of the 2025 NX 350 F Sport, I can tell you it feels far superior to ...",
    "source": "Autoblog",
    "titleSummary": "\"Taking the Lexus NX 350 F Sport for a Spin: A Candid Assessment\"",
    "descriptionSummary": "The original NX was solid, but unremarkable. Enter the revamped 2025 model: Lexus has noticeably elevated its design and performance standards, making this latest iteration of the NX a truly standout experience on the road."
  },
  {
    "title": "‘We Can Build Cars People Love’: Jeep CEO Bob Broderdorf’s Turnaround Plan",
    "link": "https://www.autoblog.com/news/jeeps-new-boss-cuts-prices-revamps-lineup-for-2025-comeback",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2MzUw/51ba8ffb8e6d5337bc3032834e937b0a0d902590.jpg",
    "description": "Jeep’s new chief executive, Bob Broderdorf, is wasting no time trying to put the brand back on solid ground. Promoted from head of Jeep North America in February 2025, Broderdorf inherited a company coming off several years of declining sales, frosty dealer relations, and customer frustration over ...",
    "source": "Autoblog",
    "titleSummary": "\"Jeep's Top Executive Maps Out a New Era of Passionate Performance\"",
    "descriptionSummary": "Following a leadership shuffle in February 2025, Bob Broderdorf took the reins as Jeep's top executive, tasked with reviving the brand after years of struggling sales, strained relationships with dealers, and mounting customer dissatisfaction."
  },
  {
    "title": "2026 Toyota Corolla Cross Vs. Mazda CX-30: 5 Major Differences",
    "link": "https://www.autoblog.com/features/2026-toyota-corolla-cross-vs-mazda-cx-30-differences",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2Mzk0/toyota-corolla-cross-and-mazda-cx-30.jpg",
    "description": "Although the Toyota RAV4 comprehensively outsells the Mazda CX-5 (and pretty much everything else) in the United States, the gap is closer between the Japanese brands’ smallest crossovers, which are the Corolla Cross and CX-30. Mazda North America sold 34,988 units of the CX-30 in the first half of ...",
    "source": "Autoblog",
    "titleSummary": "\"Corolla Crossover vs. Mazda Matchup: Key Distinctions in Latest Model Showdown\"",
    "descriptionSummary": "The Toyota RAV4's dominance over its rivals in the US market doesn't necessarily translate to a clear advantage for the smaller Corolla Cross versus Mazda's CX-30. Despite being outsold by the RAV4, their sales are surprisingly close. In the first six months of the year, Mazda moved 34,988 CX-30s."
  },
  {
    "title": "Ian Callum Wants To Turn The Aston Martin Vanquish Into A Strangely Beautiful Wagon",
    "link": "https://www.autoblog.com/news/ian-callum-proposes-aston-martin-vanquish-shooting-brake",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2NjUz/callum-vanquish-25-shooting-brake.jpg",
    "description": "Ian Callum is arguably one of the finest automotive designers of our time, having worked on several of the most timeless cars of the last 40 years, including the millennial Aston Martin Vanquish. Now in charge of his own design firm, Callum Designs, he's proposed a more practical take on the ...",
    "source": "Autoblog",
    "titleSummary": "\"Aston Martin's Iconic Vanquish Transformed into a Unique and Stylish Estate Car\"",
    "descriptionSummary": "Legendary designer Ian Callum, known for his work on iconic vehicles like the Aston Martin Vanquish, now helms his own design studio. His latest concept reimagines sleekness with practicality in mind."
  },
  {
    "title": "Novitec Turns Rolls-Royce Cullinan Into 697-HP Widebody Beast",
    "link": "https://www.autoblog.com/news/novitec-rolls-royce-cullinan-overdose-widebody",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM2NDcw/5__fitmaxwzeyodasmtaynf0.jpg",
    "description": "Novitec is a German tuner that’s known for specializing in upgrades for Italian automakers like Ferrari and Alfa Romeo. The Bavaria-based company also has a separate division called Spofec, which specifically tunes Rolls-Royce models, and it’s this division that’s responsible for a particularly ...",
    "source": "Autoblog",
    "titleSummary": "\"Novitec Transforms Luxurious Rolls-Royce into a 697-Horsepower Road Warrior\"",
    "descriptionSummary": "Innovative tuning firm Novitec has built a reputation for enhancing high-performance Italian vehicles from Ferrari to Alfa Romeo. Its subsidiary, Spofec, caters exclusively to luxury British brand Rolls-Royce, producing bespoke upgrades for select models."
  },
  {
    "title": "Genesis Launches Attractive G80 August Lease Offer",
    "link": "https://www.autoblog.com/carbuying/genesis-launches-attractive-g80-august-lease-offer",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTMzNzY1/2025-genesis-g80-f.jpg",
    "description": "2025 Genesis G80 updates keep it competitive, but its chief rival has a cheaper lease Even more so than its chief Asian rival, the&nbsp;Lexus&nbsp;ES, the&nbsp;Genesis&nbsp;G80 is a mid-size luxury sedan that truly makes its case as a genuine mid-size luxury sedan. While the Lexus ES is hindered by ...",
    "source": "Autoblog",
    "titleSummary": "\"Genesis Scores with Lucrative G80 Lease Deal This August\"",
    "descriptionSummary": "The 2025 Genesis G80 refresh aims to maintain its competitive edge, but its primary competitor offers a more affordable lease option, posing a challenge to the G80's status as a top-tier luxury sedan."
  },
  {
    "title": "3 Reasons Why Big Pickups Still Drive Huge Profits for Carmakers",
    "link": "https://www.autoblog.com/news/3-reasons-why-big-pickups-still-drive-huge-profits-for-carmakers",
    "pubDate": "8/11/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyODM1MTgyODkyMzYxMzQ0/2025-chevrolet-silverado.jpg",
    "description": "S&amp;P Global Mobility reported that four segments are driving over half of new U.S. vehicle sales, and full-size half-ton pickups captured the list’s fourth spot with an 8.2% market share. While full-size half-ton pickup trucks had fewer total vehicle sales than compact utilities, upper midsize ...",
    "source": "Autoblog",
    "titleSummary": "\"Full-Sized Trucks Remain Profit Powerhouses for Automakers\"",
    "descriptionSummary": "New data from S&P Global Mobility reveals that four key segments are responsible for over half of all new US vehicle sales, with full-size half-ton pickups ranking fourth and accounting for 8.2% of the market."
  }
]