[
  {
    "title": "Build Your Own: Ford’s Bronco Silver Lake Dunes Projects Aren’t on the Lot",
    "link": "https://www.autoblog.com/news/fords-silver-lake-dunes-broncos-arent-for-sale-but-you-can-build-one",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5ODA3/bronco-and-bronco-sport-silver-lake-dunes-project-vehicles_01.jpg",
    "description": "Ford is marking the Bronco’s 60th anniversary in more ways than one. Alongside the official 60th Anniversary Edition package revealed a few weeks ago, the brand has also created two special project vehicles. Called the Bronco Silver Lake Dunes Project Vehicle and the Bronco Sport Silver Lake Dunes ...",
    "source": "Autoblog",
    "titleSummary": "Broncos Tailored to Thrill: Custom Off-Roaders Now Available, Not in Dealership Inventories",
    "descriptionSummary": "To celebrate six decades of iconic off-roading, Ford is launching not one but three unique tributes to the Bronco legacy: a limited-edition package and two specially crafted project vehicles."
  },
  {
    "title": "Honda Drops an Attractive Pilot Lease Offer for August",
    "link": "https://www.autoblog.com/carbuying/honda-drops-an-attractive-pilot-lease-offer-for-august",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNzMxNTYxNDM3NTcwNTY5/2025-honda-pilot-trailsport.jpg",
    "description": "Honda Drops an Attractive Pilot Lease Offer for August If you’ve been thinking about getting into a new SUV, Honda's August lease offers could make the timing just right. The latest deals offer you the opportunity to drive a well-equipped model for less than you might expect. Through September 2, ...",
    "source": "Autoblog",
    "titleSummary": "\"Hot Deals Ahead: Honda's Exclusive Pilot Lease Deal Heats Up in August\"",
    "descriptionSummary": "Honda is kicking off the summer with a compelling Pilot lease deal in August. For a limited time, prospective SUV buyers can snag a feature-packed model at an unbeatable price point, making it an ideal moment to make a move."
  },
  {
    "title": "I Drove the 2025 Mazda MX-5 Miata, Here Is How It Compares to the Honda S2000",
    "link": "https://www.autoblog.com/reviews/i-drove-the-2025-mazda-mx-5-miata-here-is-how-it-compares-to-the-honda-s2000",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkwMTc4/2023-mazda-miata.jpg",
    "description": "As I peered down the winding canyon road, I anticipated the next turn and pitched the Miata into it with ease. I know every turn on this road because I take every press car I drive on it, but this time, it felt different. The 2025 Mazda MX-5 Miata has such communicative steering that it felt like ...",
    "source": "Autoblog",
    "titleSummary": "\"Unleashing Retro Revival: A Spin in the 2025 Mazda MX-5 vs Honda S2000 Heir\"",
    "descriptionSummary": "As I navigated the serpentine canyon road, my senses came alive with anticipation of each twist and turn. Familiar territory, yet something about this drive felt refreshingly new, as if the 2025 Mazda MX-5's precision handling had awakened a deeper connection to the road."
  },
  {
    "title": "We miss the Mitsubishi Montero. Rumor has it that the brand could bring it back. Say it's so!",
    "link": "https://www.autoblog.com/news/could-mitsubishi-bring-a-new-montero-to-america",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NDUx/openart-image_mv04x0kv_1755271399310_raw.jpg",
    "description": "The Mitsubishi Montero hasn’t been sold in the U.S. in almost two decades. The legendary off-road icon and Dakar Rally champion is also known as the Pajero in overseas markets, where it’s still sold today. There's also a smaller Pajero Sport. If you take one look at Mitsubishi’s American lineup, ...",
    "source": "Autoblog",
    "titleSummary": "\"Longing for Legacy: Could Mitsubishi's Beloved Off-Roader Make a Comeback Soon?\"",
    "descriptionSummary": "A rare sight on US roads for nearly 20 years, the Mitsubishi Montero has a storied past as an off-road powerhouse and Dakar Rally winner. Overseas, it's still sold under its original name, Pajero, with a smaller sibling called Pajero Sport also available in some markets."
  },
  {
    "title": "5 Reasons Why the 2026 I6 Dodge Charger Helps You Forget the V8 Challenger",
    "link": "https://www.autoblog.com/news/5-reasons-why-the-2026-i6-dodge-charger-helps-you-forget-the-v8-challenger",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM0OTY5/sixpack-powered-2026-dodge-charger-scat-pack.jpg",
    "description": "Many auto enthusiasts were understandably sad to see the storied V8 Challenger exit Dodge’s production lineup. However, muscle car fans will soon be able to enjoy the 2026 Dodge Charger Sixpack, and this new lineup’s specs make the V8 Challenger’s phaseout an easier pill to swallow. Starting at ...",
    "source": "Autoblog",
    "titleSummary": "\"Charging Ahead: How the I6-Powered Charger Leaves the V8 Challenger in Its Dust\"",
    "descriptionSummary": "The demise of the iconic V8 Challenger may have left enthusiasts grieving, but the upcoming 2026 Dodge Charger Sixpack is set to revive muscle car magic with impressive specs that offer a more palatable reason for the V8 Challenger's departure."
  },
  {
    "title": "Francis Ford Coppola's Movie-Used Tucker is Hitting The Auction Block at Pebble Beach",
    "link": "https://www.autoblog.com/news/francis-ford-coppolas-movie-used-tucker-is-hitting-the-auction-block-at-pebble-beach",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NDU1/1948-tucker-48_1.jpg",
    "description": "Celebrated filmmaker Francis Ford Coppola is considered by critics, cinephiles, and Letterboxd enthusiasts as one of the greatest and most influential filmmakers in the history of cinema. Although he is known for classics such as&nbsp;The Godfather&nbsp;trilogy and&nbsp;Apocalypse Now, the Detroit ...",
    "source": "Autoblog",
    "titleSummary": "\"Rarity on Wheels: A Piece of Film History Goes Under the Hammer\"",
    "descriptionSummary": "Francis Ford Coppola's cinematic legacy has earned him widespread acclaim from critics and film enthusiasts alike. A masterful storyteller behind iconic films like The Godfather and Apocalypse Now, he continues to shape American cinema in profound ways."
  },
  {
    "title": "Truck Giants Sue California Over Strict New Emissions Rules",
    "link": "https://www.autoblog.com/news/truck-giants-sue-california-over-strict-new-emissions-rules",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NjQ3/trucks_emissions_california.png",
    "description": "Four of the biggest names in the trucking industry are taking California to court, arguing the state should not be allowed to enforce its tough new emissions rules. California is no stranger to strict vehicle laws, often ranking high among states with the strictest traffic laws. But this fight is ...",
    "source": "Autoblog",
    "titleSummary": "\"Big Rigs Challenge State's Tough New Greenhouse Gas Regulations\"",
    "descriptionSummary": "A quartet of leading trucking companies is challenging California's stringent new emissions regulations in court, claiming they cannot be enforced. The state's reputation for stringent traffic laws has been well-established over the years."
  },
  {
    "title": "High-Performance Silverado, Tahoe, and Escalade Packages to Hit Dealers Soon",
    "link": "https://www.autoblog.com/news/high-performance-silverado-tahoe-and-escalade-packages-to-hit-dealers-soon",
    "pubDate": "8/16/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODk0NTg2/2025-chevrolet-suburban-high-country.jpg",
    "description": "Holley, a prominent manufacturer of speed parts like its ubiquitous carburetors, and Callaway Cars, best known for its modified Corvettes, are teaming up to \"develop and launch a line of performance packages for GM trucks and SUVs,\" the companies said in a press release. Holley and Callaway didn't ...",
    "source": "Autoblog",
    "titleSummary": "\"General Motors Set to Debut Elite Performance Editions of Popular SUVs and Trucks\"",
    "descriptionSummary": "Performance giants Holley and Callaway Cars are joining forces to create customized high-performance packages for General Motors' lineup of rugged trucks and versatile SUVs, aiming to unlock their full potential."
  },
  {
    "title": "McLaren to Auction 2026 F1 Car at Abu Dhabi GP — Before It Races",
    "link": "https://www.autoblog.com/news/mclaren-to-auction-its-2026-formula-1-car-before-it-ever-races",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MTky/mclaren-racing-auction.jpg",
    "description": "In a motorsport first, McLaren will auction its yet-to-be-raced 2026 Formula 1 car during the Abu Dhabi Grand Prix weekend on&nbsp;December 5, alongside its upcoming IndyCar entry and 2027 WEC hypercar. The winning bidder will not only get their car — but also they will get VIP paddock access, ...",
    "source": "Autoblog",
    "titleSummary": "\"Racing Rarity Goes Under the Hammer in Abu Dhabi Ahead of Debut\"",
    "descriptionSummary": "McLaren is set to make history by auctioning off a brand-new, untested 2026 Formula 1 car during the Abu Dhabi Grand Prix on December 5, along with its upcoming IndyCar and 2027 WEC hypercar entries. The winning bidder will receive a unique motorsport package, including VIP paddock access."
  },
  {
    "title": "EV Sales Are Exploding on Carvana With These 3 Models Leading the Way",
    "link": "https://www.autoblog.com/news/ev-sales-exploding-on-carvana-3-models-leading-the-way",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MDAx/carvana-used-car-vending-machine-indianapolis.jpg",
    "description": "Carvana has been making headlines over the past couple of years with its significant stock rebound, but fewer may be aware of its noteworthy gains in electric vehicle (EV) sales during the same period. EVs accounted for nearly one in 10 Carvana sales during Q2 this year, a surge jump-started by an ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Vehicle Demand Booms at Carvana, Led by Trio of Top-Selling Models\"",
    "descriptionSummary": "Carvana's remarkable stock recovery has dominated recent news cycles, but behind the scenes, the company is also witnessing a significant shift towards electric vehicle (EV) sales. In Q2, EVs comprised nearly 10% of Carvana's total sales, marking a substantial increase driven largely by an initial boost."
  },
  {
    "title": "Acura Shifts Gears, Says Hybrids Will Join EVs in Electrification Push",
    "link": "https://www.autoblog.com/news/acura-shifts-gears-says-hybrids-will-join-evs-in-electrification-push",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM0ODYz/2022-acura-rdx.jpg",
    "description": "The announcement from Honda's luxury brand is a shift from its prior commitment to EVs made in 2021.",
    "source": "Autoblog",
    "titleSummary": "Acura Electrifies Lineup with Hybrid and Electric Models Ahead of Schedule",
    "descriptionSummary": "Honda's luxury arm has made a significant pivot from its previous plan to prioritize electric vehicles, revealed as part of a major brand update last year."
  },
  {
    "title": "BMW Warhol and Mehretu Art Cars Make U.S. Debut Together at Monterey",
    "link": "https://www.autoblog.com/news/bmw-brings-andy-warhols-iconic-m1-and-new-hybrid-v8-art-car-to-pebble-beach",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NTg1/p90361873_highres_andy-warhol-bmw-m1-1.jpg",
    "description": "BMW is pulling out all the stops for the 74th Pebble Beach Concours d’Elegance, using the event to showcase two of its most iconic Art Cars side-by-side in North America for the first time: Andy Warhol’s 1979&nbsp;BMW M1 Group 4&nbsp;and Julie Mehretu’s 2024&nbsp;BMW M Hybrid V8. It’s part of a ...",
    "source": "Autoblog",
    "titleSummary": "\"Warhols and Masterworks on Wheels: BMW's Art Car Collection Hits Monterey\"",
    "descriptionSummary": "For the 74th Pebble Beach Concours d'Elegance, BMW is making a statement with an unprecedented display: two Art Cars, each a masterpiece in its own right, will be showcased together for the first time in North America - Warhol's M1 and Mehretu's M Hybrid V8."
  },
  {
    "title": "Ram Unveils Dakota Nightfall Concept, Hints at U.S. Comeback",
    "link": "https://www.autoblog.com/news/ram-unveils-dakota-nightfall-concept-hints-at-u-s-comeback",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5Mzcw/novaramdakotanightfallconcept2.jpg",
    "description": "The Dakota is back—but only in Brazil. This week Stellantis unveiled the Ram Dakota Nightfall concept in São Paulo, previewing a new smaller model from the truck brand that's scheduled to reach the Brazilian market in 2026. Ram previously confirmed a new midsize pickup for the United States in 2027 ...",
    "source": "Autoblog",
    "titleSummary": "\"Ram Delves into Darkness with Dakota Concept, Signals Stateside Resurgence\"",
    "descriptionSummary": "In a surprise move, Ram is reviving its iconic Dakota nameplate - but only for the Brazilian market. A sleek Nightfall concept debuted this week in São Paulo, previewing an all-new, compact truck arriving in Brazil by 2026."
  },
  {
    "title": "1962 Cadillac Series 62 Restomod With Low Miles",
    "link": "https://www.autoblog.com/carbuying/1962-cadillac-series-62-for-sale-with-low-miles",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5Mzk2/1962-cadillac-series-62-coupe.jpg",
    "description": "This 1962 Cadillac Series 62 Restomod doesn’t just roll; it floats. From the long black body to the vintage teal interior, it’s got all the Sixties swagger you could want, but it’s the updated hardware underneath that makes it a real standout. With a modern LT1 V8 and custom air ride, it’s a ...",
    "source": "Autoblog",
    "titleSummary": "\"Low-Mileage Retro Revival: A Rare '62 Cadillac Gets a Modern Makeover\"",
    "descriptionSummary": "This '62 Cadillac Series 62 is a sleek time capsule with a vintage twist. Its bold black body and teal interior exude retro charm, while beneath lies a potent LT1 V8 and advanced air suspension that puts modern muscle under the classic skin."
  },
  {
    "title": "Texas Theft Ring Steals $1M in Camaros & Corvettes, 29 Cars Recovered",
    "link": "https://www.autoblog.com/news/thieves-stole-1-1m-in-camaros-and-corvettes-police-found-them-on-instagram",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTIzMjky/2019-chevrolet-camaro.jpg",
    "description": "A brazen theft ring in Texas managed to steal more than&nbsp;$1.1 million worth&nbsp;of Chevrolet Camaros and Corvettes in just two months, according to the Plano Police Department. Their preferred targets were parked in apartment complexes and gym lots — prime hunting grounds for crews exploiting ...",
    "source": "Autoblog",
    "titleSummary": "\"High-Stakes Car Heist Busted in Texas, Thieves Foiled with Recovery of Luxury Vehicle Cache\"",
    "descriptionSummary": "Thieves in Texas made off with over $1.1 million worth of high-end Chevrolets from unsuspecting owners in a matter of weeks. The brazen thieves targeted cars left overnight at apartments and gyms, taking advantage of lax security."
  },
  {
    "title": "Hennessey Venom F5 LF Combines Manual Gearbox With The World's Most Powerful Internal Combustion Engine",
    "link": "https://www.autoblog.com/news/venom-f5-revolution-lf-one-off-monterey-car-week",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NDAy/hennessey-venom-f5-lf.jpg",
    "description": "Monterey Car Week is always a festival of the finest new supercars and hypercars, and Hennessey is back this year with another exquisite creation, the one-off Venom F5 Revolution LF, a manual hypercar built by Hennessey's new division for bespoke requests: Maverick. As the name indicates, the car ...",
    "source": "Autoblog",
    "titleSummary": "\"Hennessey's Exotic Beast Unleashes Maximum Fury with Manual Transmission and 1,817-Horsepower Powerhouse\"",
    "descriptionSummary": "Each year, Monterey Car Week shines a spotlight on the world's most exclusive supercars and hypercars. This time around, Hennessey is unveiling a unique masterpiece: the Venom F5 Revolution LF, a handcrafted manual marvel born from its bespoke Maverick division, catering to discerning clients with tailored desires."
  },
  {
    "title": "One-Off Range Rover SV Asilomar Is Bespoke Opulence For A Great Cause",
    "link": "https://www.autoblog.com/news/range-rover-sv-asilomar-one-off-monterey",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NDc1/range-rover-sv-asilomar.jpg",
    "description": "Over the past six weeks or so, JLR has been releasing several limited editions based on the Range Rover Sport SV, with the SV Nocturne as the first of a series of three Bespoke models, the SV Black as the second, and the SV Carbon as the last. Now, it's the turn of the non-Sport Range Rover, with ...",
    "source": "Autoblog",
    "titleSummary": "\"£10 Million Range Rover Rolls Out in Ultra-Luxurious Charity Edition\"",
    "descriptionSummary": "Land Rover is continuing its streak of limited-edition releases, following up on the bespoke Range Rover Sport SV lineup with a trio of exclusive models for its flagship Range Rover."
  },
  {
    "title": "CX and CX.R Gran Turismo Vision Concepts Offer Glimpse of Corvette’s High-Performance Future",
    "link": "https://www.autoblog.com/news/corvette-cx-and-cx-r-gran-turismo-vision-concepts-preview-the-next-era-of-performance",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MDQ2/chevrolet-corvette-cx-r---front-sunset.jpg",
    "description": "It’s been more than 60 years since the first Chevrolet Corvette hit the road and the bowtie brand has pushed the limits of performance ever since, most recently revealing the 1,250-horsepower ZR1X hybrid. During that debut, despite referring to the $207,395 sports car as the “ultimate” Corvette, ...",
    "source": "Autoblog",
    "titleSummary": "\"Corvette Unveils Blazing Roadsters that Set Stage for Its Most Thrilling Rides Yet\"",
    "descriptionSummary": "For over six decades, Chevrolet has been pushing the boundaries of high-performance driving with each new Corvette iteration, culminating in the game-changing ZR1X hybrid, boasting an astonishing 1,250 horsepower."
  },
  {
    "title": "Hyundai Announces Killer 2025 Santa Fe Hybrid Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-hyundai-santa-fe-hybrid-lease-deal-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4NzE2/large-66878-2026santafehybrid.jpg",
    "description": "The 2026 Hyundai Santa Fe Hybrid has “Korean Land Rover” vibes. It's more radically styled than any other contender in the mid-size SUV segment, and it’s all the better for it. The boxy, head-turning looks set it apart from the rest of the pack, and the modern cabin is just about the freshest one ...",
    "source": "Autoblog",
    "titleSummary": "\"Hyundai Steals the Show with Unbeatable 2025 Santa Fe Hybrid Leasing Offers This Month\"",
    "descriptionSummary": "The 2026 Hyundai Santa Fe Hybrid boasts a bold, unapologetic design that sets it ablaze in the mid-size SUV landscape. Its edgy styling and sleek interior make it a standout in a crowded segment, turning heads with ease."
  },
  {
    "title": "Lexus Reveals LFA-Inspired Styling For Its Next-Generation Sports Car",
    "link": "https://www.autoblog.com/news/lexus-reveals-sport-concept-monterey-car-week",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MzQ2/lexus-sport-concept.jpg",
    "description": "Say hello to the Lexus Sport Concept, a surprise reveal at The Quail, A Motorsports Gathering at this year's edition of Monterey Car Week. Far more evolved than the Electrified Sport Concept yet still just on the other side of reality, this concept is described as a \"progressively styled, ...",
    "source": "Autoblog",
    "titleSummary": "Lexus Unveils Electrifying Design for High-Octane Future of Performance Driving",
    "descriptionSummary": "Meet the Lexus Sport Concept, unveiled unexpectedly at The Quail during Monterey Car Week. This sleek vehicle seamlessly bridges the gap between fantasy and reality, boasting an audaciously styled design that's both captivating and innovative."
  },
  {
    "title": "New EV Battery Aims to Last Shocking Amount of Miles for Less Money",
    "link": "https://www.autoblog.com/news/new-ev-battery-aims-to-last-shocking-amount-of-miles-for-less-money",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MDQ1/catl-naxtra-battery.jpg",
    "description": "The world’s largest battery company, CATL, has designed its new electric vehicle (EV) battery made from salt to last up to 3.6 million miles. This product, officially named Naxtra, is the world’s first mass-produced sodium-ion battery. The battery was initially announced in April, but information ...",
    "source": "Autoblog",
    "titleSummary": "\"Game-Changing EV Battery Promises Unbeatable Range and Lower Operating Costs\"",
    "descriptionSummary": "CATL, a pioneering leader in battery technology, has unveiled its cutting-edge EV battery made from salt-based materials. Dubbed Naxtra, this revolutionary sodium-ion battery boasts an impressive lifespan of up to 3.6 million miles, setting a new standard for the industry."
  },
  {
    "title": "Infiniti Reveals Powerful QX80 Track And Terrain Concepts To Preview One New Vehicle",
    "link": "https://www.autoblog.com/news/infiniti-reveals-qx80-track-spec-trail-spec-concepts",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5Mjg5/infiniti-qx80-track-spec-and-qx80-terrain-spec-concepts.jpg",
    "description": "The full-size luxury SUV space is highly competitive, and the Infiniti QX80 is proof, with sales in the United States varying above and below the five-figure mark over the last five years. But Infiniti is taking action. After releasing the new QX80 Sport for 2026 last week with additional luxury ...",
    "source": "Autoblog",
    "titleSummary": "\"Infiniti Teases Off-Road Capabilities with Dual-Faced QX80 Concepts\"",
    "descriptionSummary": "The full-size luxury SUV market has been a crowded space in recent years, with the Infiniti QX80 experiencing fluctuating sales that have sometimes dipped below $100,000. To revamp its flagship model, Infiniti has just introduced the 2026 QX80 Sport with enhanced luxury features."
  },
  {
    "title": "Ford Offers Compelling 2025 Escape PHEV Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-ford-escape-phev-lease-deal-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODgzNTY3/2023-ford-escape-plug-in-hybrid.jpg",
    "description": "The Ford Escape has carved out a place in the crowded compact SUV segment by offering a blend of practicality, comfort, and tech. In its plug-in hybrid (PHEV) form, it adds the benefit of electric-only driving for short trips while keeping the gas engine for longer journeys — an attractive middle ...",
    "source": "Autoblog",
    "titleSummary": "Ford Rolls Out Sweet Summer Offer on Its New Plug-In Hybrid Escape Model",
    "descriptionSummary": "The Ford Escape has established itself as a standout in the compact SUV market, delivering a winning combination of versatility, comfort, and innovation. Its plug-in hybrid model takes this to the next level with electric propulsion for urban excursions and a gasoline backup for extended road trips."
  },
  {
    "title": "Infiniti QX65 Monograph Previews A New Mid-Size Luxury Crossover Coming Soon",
    "link": "https://www.autoblog.com/conceptcars/infiniti-qx65-monograph-wants-to-steal-the-genesis-gv80s-lunch-money",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MjU1/infiniti-qx65-monograph.png",
    "description": "From 2002 until 2013, Infiniti sold the FX crossover in place of the QX4 as its mid-size luxury SUV, and until 2017, effectively the same recipe continued under the QX70 name. Now, Infiniti is ready to bring back a coupe crossover for this segment, revealing the QX65 Monograph at Monterey Car Week. ...",
    "source": "Autoblog",
    "titleSummary": "\"Infiniti Teases Sleek, High-Tech Midsize SUV Set to Shake Up Luxury Ranks Next Year\"",
    "descriptionSummary": "After bowing out of the luxury SUV scene in 2013, Infiniti is reviving its mid-size presence with a sleek new offering. The QX65 Monograph made its debut at Monterey Car Week, marking the brand's return to the coupe crossover market."
  },
  {
    "title": "Lucid Shows Its Wild Side With Lifted Gravity X Concept",
    "link": "https://www.autoblog.com/news/lucid-shows-its-wild-side-with-gravity-x-concept",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MTE5/lm25_gravity-cross_ext-7144.jpg",
    "description": "Almost a year after the Lucid Gravity went into production, the EV maker is exploring a number of unique applications for the large SUV. Last month, Lucid announced that it has confirmed a six-year deal with Uber to deploy thousands of self-driving Gravity robotaxis, and now, the company has ...",
    "source": "Autoblog",
    "titleSummary": "\"Lucid Takes a Leap into Uncharted Territory with Radical New Gravity X Design\"",
    "descriptionSummary": "Lucid Motors is pushing the boundaries of its Lucid Gravity large electric SUV nearly a year after production began. A recent partnership with ride-hailing giant Uber will see thousands of autonomous Gravities deployed on roads, marking a significant new direction for the EV maker."
  },
  {
    "title": "BMW Offers High-Octane 2025 M2 Coupe Lease Deal For August",
    "link": "https://www.autoblog.com/carbuying/2025-bmw-m2-coupe-lease-deal-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MzYzODM1MTY3OTc1MDYy/p90497867_highres_the-all-new-bmw-m2-z.jpg",
    "description": "The BMW M2 has carved out a loyal following since its debut, offering compact dimensions, rear-wheel drive, and the kind of old-school driving engagement that’s becoming rare in modern performance cars. Its wide fenders, aggressive stance, and muscular turbocharged engine make it a favorite among ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW Revs Up Its August Sales with a Sizzling New Lease Offer\"",
    "descriptionSummary": "The BMW M2 has won over enthusiasts with its unique blend of agility and raw power, thanks to rear-wheel drive and a potent turbocharged engine. Its sleek design and diminutive size have earned it a devoted fan base among driving purists."
  },
  {
    "title": "Global EV Sales Growth Slows to 21% in July as China Pauses Subsidies",
    "link": "https://www.autoblog.com/news/global-ev-sales-slow-as-china-cools-and-europe-heats-up",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5NjMz/ev_sales_war.jpg",
    "description": "July’s electric vehicle sales numbers brought a reality check for the industry. According to research firm Rho Motion, global deliveries of plug-in cars — both full battery electrics and plug-in hybrids — rose 21% year-over-year. That’s still solid, but it’s also the slowest growth rate since ...",
    "source": "Autoblog",
    "titleSummary": "Electric Vehicle Boom Hits Speed Bump as China's Incentive Program Falters",
    "descriptionSummary": "Electric vehicle sales showed a moderate pace in July, with plug-in car deliveries increasing 21% globally compared to last year, according to Rho Motion's latest research. Growth is steady, yet the industry's momentum has begun to plateau."
  },
  {
    "title": "Chevy Won’t Like The 2026 Nissan Armada Nismo’s Price",
    "link": "https://www.autoblog.com/news/chevy-wont-like-the-2026-nissan-armada-nismos-price",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTEwODIw/2026-armada-nismo-6-10.jpg",
    "description": "Almost two months since revealing the potent Nissan Armada Nismo, the Japanese automaker has now revealed pricing for the entire Armada lineup. This full-size SUV is a vast improvement over its predecessor, and the top trims have enough luxury for most, without resorting to the high price tag of ...",
    "source": "Autoblog",
    "titleSummary": "Nissan Armada Nismo Set to Give Luxury SUV Rivals a Run for Their Money",
    "descriptionSummary": "Nissan has finally unveiled pricing for its refreshed Armada lineup, just two months after introducing the powerful Nismo variant. The 2023 model boasts significant upgrades and offers a luxurious experience at an affordable price point."
  },
  {
    "title": "Rivian CEO Teases More Affordable EVs During Podcast Appearance",
    "link": "https://www.autoblog.com/news/rivian-ceo-teases-more-affordable-evs-during-podcast-appearance",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4ODYy/key-speakers-at-the-bloomberg-technology-conference.jpg",
    "description": "On August 5, California-based EV automaker Rivian posted its second-quarter 2025 earnings numbers, recording yet another quarter in the red. According to Rivian, the raw numbers show that in the three months that ended on June 30, 2025, the company posted a net loss of $1.115 billion and an ...",
    "source": "Autoblog",
    "titleSummary": "\"Rivian Seeks to Broaden its Electric Lineup with Smaller, Cheaper Models on the Horizon\"",
    "descriptionSummary": "Rivian, the California-based electric vehicle manufacturer, has released its second-quarter 2025 earnings report, revealing another quarter of financial losses. The company's net loss for Q2 came in at $1.115 billion amidst ongoing operating challenges."
  },
  {
    "title": "Ford Reveals Mustang GTD Liquid Carbon at Laguna Seca",
    "link": "https://www.autoblog.com/news/ford-mustang-gtd-liquid-carbon-reveal",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4OTU3/2025-mustang-gtd-liquid-carbon_05.jpg",
    "description": "When Ford introduced the Mustang GTD, it pushed the nameplate into territory long dominated by European and Japanese supercars. Developed alongside the Mustang GT3 race car, the GTD combined advanced aerodynamics, lightweight construction, and a powertrain capable of competing on the most demanding ...",
    "source": "Autoblog",
    "titleSummary": "\"Ford Unveils Track-Focused Mustang GTD in Stunning Liquid Carbon Makeover\"",
    "descriptionSummary": "Ford's introduction of the Mustang GTD marked a significant departure from tradition, as it entered a competitive arena once dominated by high-performance European and Japanese supercars. This potent variant leverages expertise gained from its sibling, the GT3 racing car."
  },
  {
    "title": "Aston Martin Valkyrie Spider Bedazzled With Over 300,000 Rhinestones For Monterey Car Week",
    "link": "https://www.autoblog.com/news/worlds-first-bedazzled-aston-martin-valkyrie-spider",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4Njcx/bedazzle-wrapped-aston-martin-valkyrie-spider.jpg",
    "description": "When you own a collection of some of the finest supercars ever made, turning up with one of them at Monterey Car Week is hardly special. How do you stand out in the esteemed company that will travel the 17-Mile Drive when your peers are also driving the latest and greatest automotive masterpieces? ...",
    "source": "Autoblog",
    "titleSummary": "\"Sparkling Supercar Blinged with 300,000 Rhinestones for Exclusive Monterey Showstopper\"",
    "descriptionSummary": "Among a sea of rare and exotic supercars, standing out at Monterey Car Week demands more than just owning a prized vehicle. What sets one apart from the elite crowd cruising 17-Mile Drive?"
  },
  {
    "title": "BMW Marks 8 Series Legacy with Limited M850i Edition M Heritage",
    "link": "https://www.autoblog.com/news/only-500-made-bmw-m850i-edition-m-heritage-honors-the-original-8-series",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM5MDEw/bmw-m850i-edition-m-heritage---05.jpg",
    "description": "The BMW 8 Series remains the brand's largest passenger car that isn't an SUV, sitting at the top of the lineup with an emphasis on luxury grand touring. Its current generation has been on the market since 2018, offered in coupe, convertible, and Gran Coupe (uhm, sedan) body styles.&nbsp; Rumors ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW Tributes Iconic 8 Series Heritage with Exclusive M850i Special Edition Release\"",
    "descriptionSummary": "At the pinnacle of BMW's non-SUV offerings is the luxurious 8 Series, a grand tourer that embodies the brand's commitment to high-end performance. Available as a sleek coupe, drop-top convertible, or elegant Gran Coupe, this flagship model debuted in 2018 and remains a coveted choice among enthusiasts."
  },
  {
    "title": "Nissan Launches Hot 2025 Altima Lease Offers for August",
    "link": "https://www.autoblog.com/carbuying/2025-nissan-altima-lease-offers-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODk3NDkx/2025-nissan-altima-sv-special-edition.jpg",
    "description": "The midsize segment is in shambles these days, with just seven models available for purchase at the time of writing. At the end of the 2025 model year, the segment is set to shrink again, with two midsize sedans heading off into the sunset. Even as the segment struggles, the Nissan Altima is still ...",
    "source": "Autoblog",
    "titleSummary": "\"Nissan Ignites August Sales with Sizzling Altima Leasing Deals\"",
    "descriptionSummary": "The midsize car market is dwindling rapidly, with only a handful of models currently available and two more set to disappear by 2025. Amidst this decline, the Nissan Altima remains a surprising holdout."
  },
  {
    "title": "A Florida Man Traded in a Ferrari F40 for an Ineos Grenadier and a Huge Check",
    "link": "https://www.autoblog.com/news/a-florida-man-traded-in-a-ferrari-f40-for-an-ineos-grenadier-and-a-huge-check",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4MjAz/2024-wheels-marinwaerdt.jpg",
    "description": "If you've ever gone through the challenging process of trading in an older car for a new one at a dealership, you may have experienced something like this. You begin by telling the salesperson that you're interested in trading in your vehicle. After that, you fill out a bunch of forms, and then a ...",
    "source": "Autoblog",
    "titleSummary": "\"Florida Collector Swaps Rare Ferrari for Rugged 4x4 and a Life-Changing Payout\"",
    "descriptionSummary": "Buying or selling a used car can be a complex transaction, often involving multiple steps after expressing interest in exchanging vehicles. This includes filling out paperwork and potentially awaiting an appraisal of the trade-in's value."
  },
  {
    "title": "Toyota Launches Efficient 2025 Prius Lease Deal for August",
    "link": "https://www.autoblog.com/carbuying/2025-toyota-prius-lease-deal-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNTgwMzEyODIyMjYxMzc2/2025-toyota-prius-limited-6.jpg",
    "description": "Thrifty shoppers are lured to the Toyota Prius — now nearly 30 years old and in its fifth generation — for its extremely economical approach to driving. Toyota’s August lease offers on the car capitalize on and emphasize its wallet-friendly ethos. In select markets, shoppers can pick up a 2025 ...",
    "source": "Autoblog",
    "titleSummary": "\"New Prius Lease Offer Brings Affordable Efficiency to August Buyers\"",
    "descriptionSummary": "For budget-conscious drivers, the Toyota Prius has long been a go-to choice due to its exceptional fuel efficiency. A recent leasing promotion highlights this value proposition, offering a 2025 model at an attractive price in certain regions."
  },
  {
    "title": "Honda Launches Killer 2025 CR-V Hybrid Lease Offers for August",
    "link": "https://www.autoblog.com/carbuying/2025-honda-crv-hybrid-lease-offers-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTI2ODY2/2026-honda-cr-v-sport-touring-hybrid.jpg",
    "description": "The Honda CR-V Hybrid has built a solid reputation as a comfortable, capable compact SUV that’s easy to live with for the long haul. It’s roomy, efficient, and dependable. Right now, leasing one could make it even easier on your budget. You can hop into a 2025 CR-V 2WD Sport Hybrid for $359/month ...",
    "source": "Autoblog",
    "titleSummary": "\"Honda Unveils Sizzling Summer Deal on 2025 CR-V Hybrid Leases\"",
    "descriptionSummary": "Experience the ease of owning a Honda CR-V Hybrid, renowned for its comfort, capability, and reliability. For a limited time, lease a 2025 CR-V 2WD Sport Hybrid starting at just $359 per month, perfect for a stress-free drive."
  },
  {
    "title": "Toyota Drops Surprising 2025 Corolla Cross Hybrid Lease Deal in August",
    "link": "https://www.autoblog.com/carbuying/2025-toyota-corolla-cross-hybrid-lease-deal-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg4ODY3ODc0NjQ1ODYw/2023-toyota-corolla-cross-hybrid-xse.jpg",
    "description": "The hybrid version of Toyota’s smallest SUV is a decent value proposition for those considering a lease. For August, Toyota is offering the subcompact SUV at $349 per month with only $2,999 due at signing. A 36-month term allows customers to travel 12,000 miles per year, for a total of 36,000 ...",
    "source": "Autoblog",
    "titleSummary": "\"2025 Toyota Corolla Cross Hybrid Offers Unbeatable Lease Deal this August\"",
    "descriptionSummary": "For August, Toyota's subcompact SUV lease offer delivers a compelling value: just $349 monthly, with a mere $3,000 down payment required. This sweet deal covers 36 months and up to 12,000 annual miles."
  },
  {
    "title": "4 Reasons I Chose All-Terrain Tires over Mud-Terrain",
    "link": "https://www.autoblog.com/features/4-reasons-i-chose-all-terrain-tires-over-mud-terrain",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4ODc0/dsc_1161.jpg",
    "description": "When I took in my Uncle’s 2006 Jeep Wrangler TJ two years ago, the first thing he told me was that it wouldn’t need tires for a while, because he’d just replaced them. Since he bought it nearly 15 years ago, he’d lifted it by four inches and fitted it with 35-inch tires on 15-inch wheels, swearing ...",
    "source": "Autoblog",
    "titleSummary": "\"Tackling Uncharted Terrain: Why ATs Won Out Over Mudders for Me\"",
    "descriptionSummary": "I inherited my uncle's 2006 Jeep Wrangler TJ two years ago, but not before he assured me that the tires were recently replaced. Little did I know, a decade of upgrades was hiding beneath its rugged exterior."
  },
  {
    "title": "I Drove the 2025 Genesis GV80 Coupe. Here’s My Brutally Honest Review",
    "link": "https://www.autoblog.com/reviews/i-drove-the-2025-genesis-gv80-coupe-heres-my-brutally-honest-review",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM4OTE3/2025-genesis-gv80-coupe.jpg",
    "description": "It’s now the brand pulling up to the party in a tailored suit while casually stealing the spotlight from the old guard. Think of the GV80 Coupe as the GV80 you already know, but with a faster roofline, stronger performance, and a little more swagger when you roll up to the valet. This segment is a ...",
    "source": "Autoblog",
    "titleSummary": "\"Taking the Wheel: A Candid Ride in the 2025 Genesis GV80 Coupe\"",
    "descriptionSummary": "Meet the GV80 Coupe, the sleek new entrant that's turning heads by combining a sporty design with exhilarating performance, effortlessly outshining its predecessor in style and sophistication."
  },
  {
    "title": "Acura Launches Attractive MDX Lease Offer for August",
    "link": "https://www.autoblog.com/carbuying/acura-launches-attractive-mdx-lease-offer-for-august",
    "pubDate": "8/15/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTM0OTYy/08_2025-acura-mdx-type-s.jpg",
    "description": "Acura&nbsp;has introduced a compelling lease offer on the 2025 MDX SH-AWD. If you’re shopping for a refined, three-row luxury SUV, this deal could make bringing an MDX home easier. The current offer is $589 per month for 36 months, with a down payment of $6,499 due at signing and a 10,000-mile ...",
    "source": "Autoblog",
    "titleSummary": "Acura Spices Up Luxury SUV Leases with Limited-Time Summer Promotion",
    "descriptionSummary": "Get behind the wheel of the luxurious 2025 Acura MDX SH-AWD for less than expected. This attractive lease deal features a monthly payment of just $589 for 36 months, with a manageable down payment and mileage limits in place."
  }
]