[
  {
    "title": "The Supersports is Returning to Become The Ultimate Bentley Continental GT The Ultimate Continental GT",
    "link": "https://www.autoblog.com/coupes/the-supersports-is-returning-to-become-the-ultimate-bentley-continental-gt",
    "pubDate": "11/6/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg3NTU4/bentley-continental-gt-supersports-teaser---441.jpg",
    "description": "It's been a while since the Supersport badge made its way to a Bentley product. It was first used in the 2009 Continental GT, along with its convertible version. The follow-up was then revealed in 2017 and labeled as the Continental GT Supersports. Yes, with an S. Now, that name is coming back to ...",
    "source": "Autoblog",
    "titleSummary": "\"Bentley Revives Iconic Super Sports Trim for Its Most Extreme Continental GT Yet\"",
    "descriptionSummary": "The Supersport badge returns to Bentley after a decade-long hiatus, marking a triumphant comeback for this high-performance variant of the Continental GT. Its legacy dates back to 2009 and now it's making a bold return."
  },
  {
    "title": "Honda’s Next-Generation V6 Is Coming — And This Time, It’s a Hybrid",
    "link": "https://www.autoblog.com/news/hondas-next-generation-v6-is-coming-and-this-time-its-a-hybrid",
    "pubDate": "11/6/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg3MzIz/honda-next-gen-v6-hybrid.jpg",
    "description": "Honda has some&nbsp;big plans for the latter half of the 2020s.&nbsp;During a recently concluded media workshop, the Japanese automaker highlighted many of its future plans, with some already debuting during the 2025 Japan Mobility Show. One of the more interesting portions of the workshop was the ...",
    "source": "Autoblog",
    "titleSummary": "\"Honda's New Eco-Powered V6 Engine Takes Center Stage with Hybrid Innovation\"",
    "descriptionSummary": "Honda is gearing up for a pivotal period in the automotive industry. At a recent media event, the company unveiled an ambitious roadmap for the late 2020s, showcasing innovative technologies and products set to debut by 2025 and beyond."
  },
  {
    "title": "New Survey Exposes New Car Buyer Attitudes Toward Chinese Cars",
    "link": "https://www.autoblog.com/news/new-survey-exposes-new-car-buyer-attitudes-toward-chinese-cars",
    "pubDate": "11/6/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2OTgw/japan-mobility-show-2025.jpg",
    "description": "The global automotive landscape is shifting dramatically towards the East. According to a new survey from the Boston Consulting Group, one of the “Big Three” management consulting firms, worldwide consumer attitudes are shifting positively toward Chinese-branded vehicles. The survey, which polled ...",
    "source": "Autoblog",
    "titleSummary": "\"Chinese Auto Makers Hit Roadblocks in Winning Over Western Buyers' Trust\"",
    "descriptionSummary": "The global auto industry is undergoing a significant eastward shift as consumers increasingly warm up to Chinese-made cars, a trend highlighted in a recent study by Boston Consulting Group, one of the world's top management firms."
  },
  {
    "title": "Bentley’s First Electric SUV Is Coming — But the V8 Isn’t Going Anywhere",
    "link": "https://www.autoblog.com/news/bentleys-first-electric-suv-is-coming-but-the-v8-isnt-going-anywhere",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg3MDQy/teaser-shot-of-upcoming-bentley-electric-suv-covered-up.jpg",
    "description": "Bentley’s next era is taking shape, and it’s clear the brand isn’t following the typical all-electric script. Instead, it’s rewriting its Beyond100+ strategy. The updated plan still includes the highly anticipated electric SUV but also rethinks Bentley’s timeline for going fully electric while ...",
    "source": "Autoblog",
    "titleSummary": "\"Bentley's Electric Leap: Powering Ahead While Heritage Remains Intact\"",
    "descriptionSummary": "Bentley is embarking on a new chapter, deviating from the standard all-electric path to instead revamp its vision for a sustainable future. A revised roadmap now incorporates an eagerly awaited electric SUV and a more nuanced transition to full electrification."
  },
  {
    "title": "First Look: BMW’s All-New iX4 Electric SUV Spied Testing",
    "link": "https://www.autoblog.com/news/spy-shots-bmw-ix4-crossover-nov-25",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NzMx/2027-bmw-ix4-spy-shot.jpg",
    "description": "When BMW introduced the X6, effectively kicking off the so-called coupe crossover craze, it just about sold well enough to justify a smaller version called the X4 in 2010. A decade and a half later, the X4 has been killed off, with the X2 effectively taking its place, but Munich isn't quite ready ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW's Electrifying Future Unveiled: Spotted! The iX4 Takes Shape on the Road\"",
    "descriptionSummary": "BMW's pioneering X6 coupe crossover sparked a market trend that led to the introduction of the compact X4 in 2010. Now, after a successful run, the X4 is being phased out, replaced by the versatile X2."
  },
  {
    "title": "The New Honda Prelude Is Missing Something the CR-Z Had — On Purpose",
    "link": "https://www.autoblog.com/news/the-new-honda-prelude-is-missing-something-the-cr-z-had-on-purpose",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTcxNTcw/2026-honda-prelude.jpg",
    "description": "That would be a manual transmission. Yes, Honda did say that the revived Prelude will be e-CVT-only even before it made its world premiere. Granted, it's an enhanced and uprated version found in the Civic hybrid, but judging by comments made about it, there is some clamor for it. Honda doesn't ...",
    "source": "Autoblog",
    "titleSummary": "Honda's Latest Prelude Leaves Out a Feature Found in Its Predecessor Intentionally",
    "descriptionSummary": "The revival of the Prelude will indeed feature a manual transmission, despite initial reports suggesting e-CVT-only models. An upgraded version of the Civic hybrid's CVT has been implemented, although some enthusiasts are still calling for the option of a stick shift."
  },
  {
    "title": "Kia Delays EV3 and Freezes EV4 Launch as EV Market Goes Cold",
    "link": "https://www.autoblog.com/news/kia-delays-ev3-and-freezes-ev4-launch-as-ev-market-goes-cold",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkxODMx/2026-kia-ev4.jpg",
    "description": "A quick glance at the October sales charts reveals that even the most dire forecasts weren’t pessimistic enough when it came to EV demand. And with sales not expected to recover anytime soon, automakers are racing to shift their future vehicle development and production plans. That includes Kia, ...",
    "source": "Autoblog",
    "titleSummary": "Kia Puts Brakes on Electric Dreams Amid Cooling Demand for Eco-Friendly Vehicles",
    "descriptionSummary": "Electric vehicle sales have surpassed all expectations in October's market trends, with forecasts now seeming overly cautious. Automakers are scrambling to reassess their manufacturing and development strategies for upcoming models, including Kia's plans."
  },
  {
    "title": "2026 Toyota Crown Signia Comes Dangerously Close To Highlander Pricing",
    "link": "https://www.autoblog.com/news/2026-toyota-crown-new-paint-pricing",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2ODQ4/2026-toyota-crown-signia.jpg",
    "description": "The Toyota Crown Signia has been updated for the 2026 model year, and only a single physical change has been made. If you choose the Limited trim instead of the cheaper XLE, you can now have two-tone paint, with a black roof on offer atop the base colors of Storm Cloud (grey), Oxygen White, Finish ...",
    "source": "Autoblog",
    "titleSummary": "\"New Toyota Crown Signia Nears Price Parity with Popular Midsize SUV\"",
    "descriptionSummary": "The Toyota Crown Signia receives its 2026 update with a subtle yet noticeable tweak: two-tone paint is now an exclusive feature for Limited trim buyers, adding a sleek black roof to grey or white base coats."
  },
  {
    "title": "Ford CEO Says Chinese Automakers Could “Put Us All Out of Business”",
    "link": "https://www.autoblog.com/news/ford-ceo-says-chinese-automakers-could-put-us-all-out-of-business",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkyNjc2/chery-aimoga-robot-at-a-chery-showroom.png",
    "description": "Ford CEO Jim Farley is warning that China’s fast-growing auto industry poses an “existential threat” to legacy carmakers, including Ford itself. Speaking on CBS Sunday Morning, Farley compared today’s competitive landscape to the 1980s, when Japanese automakers began to dominate the U.S. market, ...",
    "source": "Autoblog",
    "titleSummary": "\"Chinese Rivals Threaten to Leave US Carmaker Ford in the Dust\"",
    "descriptionSummary": "Ford CEO Jim Farley sounded a cautionary note, describing China's surging auto industry as a potentially catastrophic threat to established car manufacturers like Ford, mirroring the disruption of the US market by Japanese automakers in the 1980s."
  },
  {
    "title": "BMW M Sales Hit New Record as Drivers Choose Horsepower Over Hybrids",
    "link": "https://www.autoblog.com/news/bmw-m-sales-hit-new-record-as-drivers-choose-horsepower-over-hybrids",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTAyMjg1/2025-bmw-m3-sedan.jpg",
    "description": "BMW’s M division has reported another record-breaking year, with global sales up 7.9% through the first nine months of 2025. That growth builds on last year’s all-time high of 206,582 vehicles, confirming that BMW’s performance arm remains one of the company’s most powerful business drivers.The ...",
    "source": "Autoblog",
    "titleSummary": "\"Revved Up Record: BMW's Performance Division Sees Unprecedented Demand\"",
    "descriptionSummary": "BMW's M division boasts a remarkable 7.9% sales surge in the first nine months of 2025, eclipsing last year's record-breaking total of over 206,000 vehicles and solidifying its status as a driving force behind BMW's continued success."
  },
  {
    "title": "This 800-HP Ringbrothers Mustang Makes Modern Muscle Look Soft",
    "link": "https://www.autoblog.com/news/this-800-hp-ringbrothers-mustang-makes-modern-muscle-look-soft",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2Njk0/1969-ford-mustang-kingpin.jpg",
    "description": "The Ringbrothers have never been shy about turning nostalgia into rolling art, and their latest creation might be their most cinematic yet. Meet KINGPIN, a 1969 Ford Mustang Mach 1 rebuilt with such obsessive detail it feels like it should come with a director’s commentary track. Debuted at the ...",
    "source": "Autoblog",
    "titleSummary": "\"Ringbrothers' Brutal 800-HP Mustang Redefines What It Means to Be a Real Muscle Car\"",
    "descriptionSummary": "Ringbrothers' latest masterpiece combines vintage style with meticulous craftsmanship, elevating a 1969 Ford Mustang Mach 1 to an immersive experience worthy of a Hollywood blockbuster. Their stunning creation debuted at a recent auto show."
  },
  {
    "title": "2027 Hyundai Tucson Caught Testing in the U.S. With Bold New Design",
    "link": "https://www.autoblog.com/news/2027-hyundai-tucson-caught-testing-in-the-u-s-with-bold-new-design",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NjIy/screenshot-2025-11-05-at-101341am.png",
    "description": "A U.S.-spec version of the upcoming 2027 Hyundai Tucson has been spotted testing in California, confirming Hyundai’s next-generation compact SUV is nearing its North American debut. The prototype, captured on video by KindelAuto, shows heavy camouflage but clear hints of a new design direction and ...",
    "source": "Autoblog",
    "titleSummary": "\"Next-Gen Hyundai Tucson Spotted Stateside with Daring Reboot Revealed\"",
    "descriptionSummary": "A sneak peek at the next-gen Hyundai Tucson has surfaced in California, suggesting the US market release isn't far off. A partially camouflaged prototype offers glimpses of its fresh styling, ahead of an imminent North American debut."
  },
  {
    "title": "Japan Wants 10,000 Driverless Cars on the Road by 2030",
    "link": "https://www.autoblog.com/news/japan-wants-10000-driverless-cars-on-the-road-by-2030",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTc2NjI5NjIzNjYyMTky/001-nissan-leaf-autonomous-vehicle-1-jpg.jpg",
    "description": "One of the most hotly debated topics in the automotive world is driverless/autonomous driving vehicles.&nbsp; The idea, while seemingly sci-fi, has already been around for decades, with multiple pushes from the biggest tech and automotive companies. We’ve also seen certain implementations mainly in ...",
    "source": "Autoblog",
    "titleSummary": "\"Japan Sets Ambitious Target to Deploy Autonomous Vehicles Nationwide by 2030\"",
    "descriptionSummary": "The future of autonomous transportation is a topic that's sparked intense debate in the automotive world, where the notion of self-driving vehicles has been gaining momentum over several decades."
  },
  {
    "title": "Lexus Launches Attractive 2026 NX Lease Deals For November",
    "link": "https://www.autoblog.com/news/2026-lexus-nx-lease-deals-november",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1ODY2/2026_lexus_nx_350h_luxury_grecianwater_025.jpg",
    "description": "After only the RX, the smaller NX is the most popular Lexus model in the United States. Now with a more hybrid-centric lineup than before, the luxury crossover isn’t particularly sporty to drive or the most practical vehicle in its class, but its peerless quality and exceptional refinement are up ...",
    "source": "Autoblog",
    "titleSummary": "\"Lexus Unveils Sizzling 2026 NX Leasing Promos for November Buyers\"",
    "descriptionSummary": "The Lexus NX has become a favorite among American buyers, eclipsing even the RX in popularity. Its focus on hybrid powertrains now tops a feature list that includes impeccable craftsmanship and silky-smooth performance."
  },
  {
    "title": "The Lightest, Most Extreme Jaguar E-Type Ever Built Just Broke Cover",
    "link": "https://www.autoblog.com/news/the-lightest-most-extreme-jaguar-e-type-ever-built-just-broke-cover",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NjM3/eagle-lightweight-gtr-09-dean-smith.jpg",
    "description": "Eagle E-Types has unveiled its most extreme creation yet, the Lightweight GTR, a one-off that redefines what a reimagined Jaguar E-Type can be. Weighing just 975 kilograms with fluids and powered by a hand-built 4.7-liter wide-angle inline-six, the GTR blends historic purity with cutting-edge ...",
    "source": "Autoblog",
    "titleSummary": "Ultra-Lightweight Jaguar Speedster Sets New Standard with Unprecedented Performance Capabilities Revealed",
    "descriptionSummary": "Eagle's most radical E-Type yet has emerged: a one-off Lightweight GTR that masterfully fuses vintage charm with modern innovation. This stunning roadster tips the scales at just 2,150 pounds, its potent 4.7-liter inline-six engine producing thrilling performance."
  },
  {
    "title": "This 550-HP Honda Odyssey Type R Is the Ultimate Sleeper Minivan",
    "link": "https://www.autoblog.com/news/this-550-hp-honda-odyssey-type-r-is-the-ultimate-sleeper-minivan",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2MTIz/honda-odyssey-type-r-sema-build.jpg",
    "description": "At first glance, it’s just another Honda Odyssey – the same family-friendly, practical shape you’d see parked outside a school or supermarket, only with peculiar exhaust tips. But pop the hood of this one-off Odyssey, and you'll see this isn't a riced-out, upbadged monstrocity. It's the real deal, ...",
    "source": "Autoblog",
    "titleSummary": "\"Minivan Monster: Meet the 550-HP Honda Odyssey That Defies Its Family Car Roots\"",
    "descriptionSummary": "Beneath its unassuming exterior, a Honda Odyssey reveals a unique twist - a distinctive exhaust system that hints at something more beneath its family-friendly façade. The result is an unconventional take on a familiar design."
  },
  {
    "title": "2025 Toyota Sienna Lease Deals Are Worth A Look This November",
    "link": "https://www.autoblog.com/carbuying/2025-toyota-sienna-lease-deals-november",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTUyMjUz/2025-toyota-sienna-platinum-hev-awd.jpg",
    "description": "For those who want a real family shuttle, forget large three-row SUVs and crossovers. The minivan is uncompromisingly practical, and it's the Toyota Sienna that's leading the sales race. That said, it's a pretty tight one right now with less than 3,000 units separating the top three, with the Honda ...",
    "source": "Autoblog",
    "titleSummary": "\"Sienna Savings Soar in November: Exclusive Leasing Offers Unveiled for 2025 Model Year\"",
    "descriptionSummary": "Ditching bulky SUVs and crossovers, families are turning to minivans for uncompromising practicality. The Toyota Sienna is currently leading the charge, but it's a close call - just 2,900 units separate the top contenders."
  },
  {
    "title": "Toyota Recalls More Than 1 Million Vehicles For A Potentially Dangerous Glitch",
    "link": "https://www.autoblog.com/news/toyota-recalls-over-1-million-cars-faulty-backup-camera",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTUzMTMwMjQ3MTA0MTEy/2016-toyota-tacoma-trd-sport-4x4-badge.jpg",
    "description": "Ford recently made news for recalling 1.5 million cars over a backup camera defect, and now the world's largest automaker is dealing with a similar problem. Toyota announced that it is conducting a noncompliance safety recall that impacts approximately 1,025,000 vehicles in the U.S. with Panoramic ...",
    "source": "Autoblog",
    "titleSummary": "\"Massive Toyota Recall Issued Over Defect That Could Pose Serious Safety Risks\"",
    "descriptionSummary": "Toyota has initiated a safety recall affecting over 1 million US vehicles equipped with defective panoramic view monitors, prompting concerns about driver visibility and road safety following a recent high-profile vehicle recall by Ford involving a similar issue."
  },
  {
    "title": "Ford’s EV Struggles Don’t Matter When Its Trucks Sell Like This",
    "link": "https://www.autoblog.com/news/fords-ev-struggles-dont-matter-when-its-trucks-sell-like-this",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NDc4/2025-ford-maverick.jpg",
    "description": "Ford’s U.S. sales climbed 1.6 percent year-over-year to 174,584 vehicles, with pickups leading the charge. The company sold 105,771 trucks in October, nearly 5 percent higher than the same month last year. This growth was driven primarily by the demand for their Maverick and Ranger models, while ...",
    "source": "Autoblog",
    "titleSummary": "Ford's Electric Headaches Ignored Amid Record-Breaking Truck Sales Frenzy",
    "descriptionSummary": "Ford's US sales surged 1.6% from last year, with pickups spearheading the increase to 174,584 vehicles. Truck sales jumped 5% in October, fueled by strong demand for the Maverick and Ranger models."
  },
  {
    "title": "Hyundai Is About to Have a Truck for Every Buyer",
    "link": "https://www.autoblog.com/news/hyundai-will-have-four-pickup-trucks-by-2030",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTMwNDUxMjIwODk5NDQw/hyundai-santa-cruz-crossover-truck-concept.jpg",
    "description": "At this point, you could say that the Hyundai Group – which includes Hyundai, Genesis, and Kia – builds just about everything: small hatchbacks, premium sedans, sports cars, electric crossovers, and big family SUVs. However, among all the vehicles across its brands, one type has been lacking for ...",
    "source": "Autoblog",
    "titleSummary": "\"Hyundai's Truck Lineup Grows with New Models and Options Unveiled\"",
    "descriptionSummary": "The Hyundai Group's impressive portfolio spans everything from compact hatches to luxury sedans, high-performance sports cars, and eco-friendly crossovers, but one crucial category has long been missing: a true, high-end truck."
  },
  {
    "title": "Even BYD Can't Escape Declining EV Sales",
    "link": "https://www.autoblog.com/news/even-byd-cant-escape-declining-ev-sales",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTY5NzI2/chinas-byds-outpaces-tesla-in-q4-becomes-top-seller-of-evs_shutterstockcom_-1582813150.jpg",
    "description": "After years of explosive growth, the electric vehicle market is hitting the brakes — and fast. In China, Europe, and the United States, once-surging demand for battery-powered cars has begun to sputter, dragging down even dominant players like BYD and Tesla. BYD, the Shenzhen-based giant often ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Shock: China's BYD Falters Amid Global EV Market Downturn\"",
    "descriptionSummary": "The electric vehicle market's rapid expansion is slowing dramatically in key regions, including China, Europe, and the US. Demand for battery-powered cars has plateaued, affecting even top players like Tesla and Chinese giant BYD."
  },
  {
    "title": "2026 Dodge Charger Scat Pack Sedan Has No Equal Under $60K",
    "link": "https://www.autoblog.com/news/2026-dodge-charger-scat-pack-sedan-pricing-and-orders",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NDY1/dg026_122ch.jpg",
    "description": "Dodge has officially opened orders for its four-door Charger Scat Pack with the SixPack powertrain, which is a 3.0-liter twin-turbo Hurricane six-cylinder engine. While consumers have struggled to embrace an electric Charger, this one is easier to love—it produces 550 horsepower and 531 lb-ft of ...",
    "source": "Autoblog",
    "titleSummary": "\"Unbeatable Performance at an Unbeatable Price: The 2026 Dodge Charger Scat Pack Dominates Its Class\"",
    "descriptionSummary": "Dodge has opened ordering for its potent Charger Scat Pack model, which boasts a 3.0-liter twin-turbocharged six-cylinder engine delivering 550 horsepower and a substantial 531 lb-ft of torque in a more accessible package than electric variants."
  },
  {
    "title": "Toyota Hints the Land Cruiser Could Get Its V8 Back",
    "link": "https://www.autoblog.com/news/toyota-hints-the-land-cruiser-could-get-its-v8-back",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NDkz/toyota-land-cruiser-300-tailgate-badge.jpg",
    "description": "The Land Cruiser is one of the most recognizable SUVs on the planet – enough for Toyota to bank on its nameplate to introduce a cheaper example. The current 300 Series, not to be confused with the smaller 250 Series now sold in the US, continues to enjoy long waiting lists across markets such as ...",
    "source": "Autoblog",
    "titleSummary": "\"Land Cruiser Fans May Soon Have Their V8 Dreams Revived Again\"",
    "descriptionSummary": "The iconic Land Cruiser has become synonymous with rugged reliability and capability, prompting Toyota to launch a more affordable variant of its legendary SUV. The new model joins a thriving market where demand remains high."
  },
  {
    "title": "Jeep Warns Hybrid SUV Owners Not to Charge After New Fire Recall",
    "link": "https://www.autoblog.com/news/jeep-recalls-wrangler-and-grand-cherokee-4xe-hybrids",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NTQy/the-2025-jeep-wrangler-backcountry-4xe-limited-edition-is-for.jpg",
    "description": "Jeep has announced a new recall for 320,065 units of the Jeep Wrangler 4xe and Jeep Grand Cherokee 4xe, the plug-in hybrid variants of these SUVs. According to the company, an internal investigation revealed that 19 fires had resulted from a fault, presumably with the high-voltage batteries of ...",
    "source": "Autoblog",
    "titleSummary": "\"Jeep Issues Urgent Warning to Hybrid SUV Drivers Over Potential Charging Hazard\"",
    "descriptionSummary": "Jeep is issuing a recall for nearly 320,000 Wrangler and Grand Cherokee models equipped with plug-in hybrid technology after an internal probe uncovered issues with their high-voltage battery systems, leading to at least 19 reported vehicle fires."
  },
  {
    "title": "Ford's 900-HP Raptor R Is a Warning Shot to Ram's SRT Trucks",
    "link": "https://www.autoblog.com/news/fords-900-hp-raptor-r-is-a-warning-shot-to-rams-srt-trucks",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2NjAx/f_150_raptor_r_project_vehicle_4_370.jpg",
    "description": "The 2025 SEMA Show is full of noise, and not just from exhausts. Ram arrived with a Mopar-built 1500 Street Truck and a Dodge Charger SIXPACK concept. The Street Truck blended low-slung stance and classic styling, while the Charger SIXPACK previewed Dodge’s muscle future in the hands of tuners. But ...",
    "source": "Autoblog",
    "titleSummary": "\"Ford Fires Back at Ram with the Raptor R: A Beastly New Challenger Emerges\"",
    "descriptionSummary": "The SEMA Show floor is abuzz with excitement as Ram unveiled its Mopar-built 1500 Street Truck alongside a show-stopping Dodge Charger SIXPACK concept, hinting at the brand's electrifying performance possibilities to come."
  },
  {
    "title": "This Sick Subaru BRAT Is the Star of Hoonigan’s Newest Gymkhana Film",
    "link": "https://www.autoblog.com/news/this-sick-subaru-brat-is-the-star-of-hoonigans-newest-gymkhana-film",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2MTc2/1v2.jpg",
    "description": "If you were a car enthusiast like me who saw YouTube become a real platform for media and entertainment, the Gymkhana videos by the late Ken Block may have been a cultural touchstone for many who appreciated cars and the people who drove them. Since the first video, Gymkhana Practice, was uploaded ...",
    "source": "Autoblog",
    "titleSummary": "\"Wrecked and Wired: A Rogue Subaru Takes Center Stage in Latest Gymkhana Thrill Ride\"",
    "descriptionSummary": "For car enthusiasts, the Gymkhana series by the legendary Ken Block marked a pivotal moment in YouTube's evolution as a media powerhouse. His adrenaline-fueled videos captivated audiences worldwide, celebrating the thrill of driving and the passion of its community."
  },
  {
    "title": "Toyota Explores The Wild Side Of All Its Powertrains At SEMA",
    "link": "https://www.autoblog.com/news/toyota-explores-the-wild-side-of-all-its-powertrains-at-sema",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTgwMDE2/camry_gt-s_concept_toyota_sema_2025_hi-res_9.jpg",
    "description": "SEMA is a celebration of not just the automobile, but man’s creativity with the automobile. At the 2025 edition of SEMA, Toyota celebrated that with a roster of seven concepts that explored ideas for every type of powertrain in the brand’s portfolio, from gas to hybrid to electric to fuel cell. The ...",
    "source": "Autoblog",
    "titleSummary": "\"Unleashing Raw Power: Toyota Unveils Turbocharged Lineup at SEMA Show\"",
    "descriptionSummary": "The Specialty Equipment Market Association (SEMA) is more than just an automotive show - it's a showcase of human ingenuity and innovation on wheels. At SEMA 2025, Toyota unveiled seven conceptual vehicles that pushed the boundaries of powertrain possibilities across its entire lineup."
  },
  {
    "title": "Toyota Revives Scion Name For Wild SEMA Off-Road Concept",
    "link": "https://www.autoblog.com/news/toyota-revives-scion-name-for-wild-sema-off-road-concept",
    "pubDate": "11/5/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1OTQ3/scion_01_concept_toyota_sema_2025_hi-res_1.jpg",
    "description": "If there is one defunct car brand that I entirely miss, it would be the Toyota-based sub-brand known as Scion. Established in 2003 and sold exclusively in the United States and Canada, Scion attempted to tap into the youth market long before social media influencers became a phenomenon. The idea ...",
    "source": "Autoblog",
    "titleSummary": "\"Scion Roars Back: Toyota Unleashes Fierce Off-Road SEMA Showstopper\"",
    "descriptionSummary": "I still have a soft spot for Scion, a short-lived Toyota offshoot launched in 2003 that aimed to capture the hearts of young drivers in North America, predating the era of social media celebrities and trendy car culture."
  },
  {
    "title": "BMW Is Giving The 7 Series A Sprinkle Of Elegance",
    "link": "https://www.autoblog.com/news/spy-shots-2027-bmw-7-series-nov-25",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg2MDI1/2027-bmw-7-series-lci-spy-shot.jpg",
    "description": "The current G70 BMW 7 Series has been on sale since 2022, and that means it's nearly time for a refresh. Spy photographers camped alongside the Nürburgring have spotted the 2027 7 Series LCI (Life Cycle Impulse, or facelift) in the one place no owner will ever take it, and their shots reveal some ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW Injects Luxury into the Revamped 7 Series with Sophisticated Flair\"",
    "descriptionSummary": "The BMW 7 Series is due for an update, with a new version expected to arrive soon. Spotted at the Nürburgring, the refreshed model hints at design changes and upgrades for the luxury sedan's next iteration."
  },
  {
    "title": "Ram Is Bringing Back SRT With Two New Performance Trucks",
    "link": "https://www.autoblog.com/news/ram-is-bringing-back-srt-with-two-new-performance-trucks",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTAxODMz/2025-ram-1500-rho.jpg",
    "description": "Ram is expanding its performance lineup with the launch of two new SRT-badged trucks within the next three months. The announcement was made during Stellantis’ Q3 2025 earnings call, where CEO Antonio Filosa confirmed the move as part of Ram’s ongoing commitment to high-performance models. The ...",
    "source": "Autoblog",
    "titleSummary": "\"Ram Rekindles High-Octane Fire with Twin Turbocharged SRT Revival\"",
    "descriptionSummary": "Ram is set to turbocharge its lineup with two new SRT-branded trucks hitting the market within the next quarter. This latest addition underscores the brand's dedication to crafting high-octane vehicles that push the boundaries of performance and capability."
  },
  {
    "title": "We May Not See a True Lexus F Model Anytime Soon",
    "link": "https://www.autoblog.com/news/we-may-not-see-a-true-lexus-f-model-anytime-soon",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNjc3Mzc4NTQ2MDgzMzM3/2025-lexus-rc-f.jpg",
    "description": "Ah, yes, the Lexus F division. It's Japan's answer to Audi RS, BMW M, and Mercedes-AMG. For nearly 20 years, it's been butting heads with some of Europe's finest with, well, varying degrees of success. But regardless, its cars could, at the very least, go toe to toe against its long-established ...",
    "source": "Autoblog",
    "titleSummary": "\"High-Performance Dreams Delayed: The Future of Lexus' F Series Remains Uncertain\"",
    "descriptionSummary": "The Lexus F division has carved out a niche for itself as Japan's premier high-performance brand, rivaling European stalwarts like Audi RS, BMW M, and Mercedes-AMG with its own unique take on speed and sophistication."
  },
  {
    "title": "BMW M Is Dropping the Competition Badge — and Manuals Could Be Next",
    "link": "https://www.autoblog.com/news/bmw-m-drops-competition-badging",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1OTky/2018-bmw-m2-competition-rear-badge.jpg",
    "description": "The G87 BMW M2 has received neither an all-wheel drive system, despite still reportedly being under consideration, nor a Competition badge, and the latter is simply not going to happen, and that applies to the G90 M5, too. In fact, none of the future cars to come out of the M division will be ...",
    "source": "Autoblog",
    "titleSummary": "\"BMW's M Division Ditches Competition Label, Manual Gearboxes in Sights for Axing\"",
    "descriptionSummary": "BMW's M division has ruled out all-wheel drive for its upcoming high-performance models, including the G87 M2 and G90 M5. No Competition trim is in the works, a departure from past practice that will extend across the entire M lineup."
  },
  {
    "title": "SPIED: Mercedes-AMG’s New Electric SUV Has a Spoiler Straight Off a Hypercar",
    "link": "https://www.autoblog.com/news/spy-shots-mercedes-amg-glc-nov-25",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1NzU1/2026-mercedes-amg-glc-eq-spy-shot.jpg",
    "description": "It's been nearly two months since Mercedes launched the all-new GLC EQ electric crossover, and now Affalterbach's attention has turned to the AMG variant. Testing is now underway on and around the Nürburgring, where our spies have caught this nearly production-ready prototype, and although a reveal ...",
    "source": "Autoblog",
    "titleSummary": "\"Mercedes-AMG's Electric Beast Gets Aggressive Makeover with High-Speed Spoiler in Tow\"",
    "descriptionSummary": "AMG is putting its high-performance stamp on Mercedes' new GLC EQ electric crossover, with testing now under way at the iconic Nürburgring. Spies have snapped images of a near-production-ready prototype in action."
  },
  {
    "title": "Family Sues Tesla Over Fatal Model S Fire, Claiming Doors Trapped Victims Inside",
    "link": "https://www.autoblog.com/news/family-sues-tesla-over-fatal-model-s-fire-claiming-doors-trapped-victims-inside",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTUzNjgz/2026-tesla-model-s.jpg",
    "description": "Tesla is facing a new wrongful-death lawsuit after a&nbsp;Model S crash in Wisconsin&nbsp;turned deadly, with the victims’ family claiming the car’s&nbsp;electronic door design&nbsp;trapped passengers inside a burning vehicle. According to court filings, Jeffrey and Michelle Bauer were killed when ...",
    "source": "Autoblog",
    "titleSummary": "Tesla Blamed in Deadly Crash After Model S Erupts into Flames, Entrapping Passengers",
    "descriptionSummary": "A tragic Model S crash in Wisconsin has led to a wrongful-death lawsuit against Tesla, with the victims' loved ones accusing the company's electronic door design of allowing passengers to become trapped in the burning car."
  },
  {
    "title": "Ford Gives The Maverick Mustang Power, And You Can Too",
    "link": "https://www.autoblog.com/news/ford-maverick-300t-kit-sema",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1ODQ5/ford-maverick-300t-concept.jpg",
    "description": "Every year, automakers like to show tuning enthusiasts that they can hang with the cool kids at SEMA by modifying one or more of their regular vehicles. The trouble is, these concepts are almost always just that - one-off ideas that will never make their way to the street. But for SEMA 2025, Ford ...",
    "source": "Autoblog",
    "titleSummary": "\"Unleash Maverick Madness with Ford's Turbocharged Twist on the Iconic Mustang Model\"",
    "descriptionSummary": "At SEMA, automakers often showcase modified versions of their production cars to prove they can keep up with tuning enthusiasts' high standards. However, these concepts rarely translate into real-world models, but one notable exception could be emerging from Ford's 2025 SEMA offerings."
  },
  {
    "title": "GM Being Sued for Fuel Pump Recall That Didn’t Fix Anything",
    "link": "https://www.autoblog.com/news/gm-being-sued-for-fuel-pump-recall-that-didnt-fix-anything",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5MDg0NTAwMjIzNjAw/2022-chevrolet-equinox-rs.jpg",
    "description": "General Motors is being hit with a new class action lawsuit that alleges that the company’s fuel pump recall didn’t repair the root cause of the issue, and didn’t include all the defective vehicles it should have covered. In early 2023, GM issued a recall affecting roughly 23,000 model year 2021 ...",
    "source": "Autoblog",
    "titleSummary": "General Motors Faces Class-Action Lawsuit Over Defective Fuel Pump Repairs",
    "descriptionSummary": "A class action lawsuit is targeting General Motors over its 2023 fuel pump recall, accusing the company of failing to adequately address the underlying problem and leaving thousands of potentially defective vehicles untouched."
  },
  {
    "title": "The 1,000 HP Hellephant Is Back—And It Costs Less Than You Think",
    "link": "https://www.autoblog.com/news/the-1000-hp-hellephant-is-back-and-it-costs-less-than-you-think",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1NjAz/direct-connection-crate-engine2.jpg",
    "description": "The era of high-performance HEMI crate engines is making a comeback. At the 2025 SEMA Show, Stellantis announced the return of its Direct Connection Hellephant A30 426 crate V8—an engine that churns out an insane 1,000 horsepower and 950 lb-ft of torque. Originally unveiled in 2018, the ...",
    "source": "Autoblog",
    "titleSummary": "\"Meet the Pocket Rocket: 1,000 HP Monster Now More Affordable\"",
    "descriptionSummary": "High-performance crate engines are experiencing a resurgence, with Stellantis reviving its flagship Direct Connection Hellephant A30 426 V8 for the 2025 SEMA Show. This beastly engine delivers a staggering 1,000 horsepower and 950 lb-ft of torque."
  },
  {
    "title": "Toyota Could Break Tradition With a Unibody Land Cruiser and Electric Power",
    "link": "https://www.autoblog.com/news/toyota-could-break-tradition-with-a-unibody-land-cruiser-and-electric-power",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1NjY3/toyota-land-cruiser-front-grille.jpg",
    "description": "Over the last seven decades, the Toyota Land Cruiser has built a reputation as a supremely capable off-roader, however, this may change in the near future. Japanese auto publication Best Car has reported that Toyota may soon ditch the traditional body-on-frame architecture in favor of an all-new ...",
    "source": "Autoblog",
    "titleSummary": "\"Shaking the Off-Road Roots: Toyota's Radical New Take on the Legendary Land Cruiser\"",
    "descriptionSummary": "A legendary off-road icon is poised for a significant overhaul. Toyota's venerable Land Cruiser may be on the cusp of a major design shift, as the company considers abandoning its rugged body-on-frame construction for a more modern approach."
  },
  {
    "title": "World’s First Wirelessly Charging Highway Is Here — More Powerful Than Tesla Superchargers",
    "link": "https://www.autoblog.com/news/worlds-first-wirelessly-charging-highway-is-here-more-powerful-than-tesla-superchargers",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTg1Njcw/electreon-wireless-charging-highway-2.jpg",
    "description": "While we have seen static wireless charging gain momentum with varying degrees of success, dynamic charging is where things start to look really futuristic. Charging your EV as it drives along the highway may feel dystopian today, but several brilliant minds have been at it for years trying to make ...",
    "source": "Autoblog",
    "titleSummary": "\"Electric Road Revolution: High-Speed Wireless Charging Hits the Open Road Nationwide\"",
    "descriptionSummary": "The future of electric vehicle charging has arrived in the form of dynamic wireless technology. Pioneers in the field are making rapid progress on systems that can recharge cars while they're in motion, bringing a seamless and futuristic driving experience within reach."
  },
  {
    "title": "Subaru’s EV Sales Hit Rock Bottom in October",
    "link": "https://www.autoblog.com/news/subarus-ev-sales-plummeted-in-october",
    "pubDate": "11/4/2025",
    "imageUrl": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkwMzU1/2026-subaru-solterra.jpg",
    "description": "We came away from our first drive of the 2026 Subaru Solterra EV impressed by the changes that had been made to the crossover. From more range to a newly designed dashboard, it’s clearly an improvement over the pre-facelift model. Earlier this year, sales of the EV appeared to be moving in the ...",
    "source": "Autoblog",
    "titleSummary": "Subaru's Electric Car Sales Plummet to Record Low in October Slump",
    "descriptionSummary": "Our initial test drive of the revamped 2026 Subaru Solterra EV left us impressed by its upgrades, including increased range and a fresh, redesigned interior. The updates hint at a significant leap forward from its predecessor."
  }
]